    {"instance_id": "686c080a9fe196501d6d202f:9:2", "textpassage": "\"The Counties’ argument that purpose in a case like this should be inferred only from the latest in a series of governmental actions, however close they may all be in time and subject, bucks common sense.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Counties’ argument that purpose in a case like this should be inferred only from the latest in a series of governmental actions, however close they may all be in time and subject, bucks common sense.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the argument presented by \"The Counties\" is being criticized for being contrary to common sense. This suggests a potential bias against \"The Counties\" by a judicial actor who favors a different interpretation. The passage does not explicitly state bias but implies it through the critique of \"The Counties' argument.\"\n\n{\"label\":\"Y\", \"prob\":0.7, \"explanation\":\"The passage criticizes 'The Count"}
    {"instance_id": "686c080a9fe196501d6d202f:9:3", "textpassage": "\"The sectarian spirit of the resolutions found enhanced expression in the third display, which quoted more of the Commandment’s purely religious language than the first two displays had done.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The sectarian spirit of the resolutions found enhanced expression in the third display, which quoted more of the Commandment’s purely religious language than the first two displays had done.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the label is \"N\" because the passage does not indicate any bias by a judicial actor against a party or class of persons. It merely describes the content of the resolutions and the use of religious language. There is no indication of bias or prejudice directed at any specific party or class. The focus is on the content of the displays and not on the actions or attitudes of any judicial actors. Therefore, the passage does not contain evidence of bias.\n\n```json"}
    {"instance_id": "686c080a9fe196501d6d2030:9:4", "textpassage": "\"The legislative record illustrates that, after accepting the monument from the Fraternal Order of Eagles—a national social, civic, and patriotic organization—the State selected a site for it based on the recommendation of the state organization that maintains the capitol grounds.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The legislative record illustrates that, after accepting the monument from the Fraternal Order of Eagles—a national social, civic, and patriotic organization—the State selected a site for it based on the recommendation of the state organization that maintains the capitol grounds.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage provided, the highlighted text does not contain bias by a judicial actor. It is a factual statement about the process of selecting a site for a monument. The passage describes a procedural and non-judicial action taken by the state, based on recommendations. There is no indication of prejudice or partiality against a party or class of persons.\n\n{\"label\":\"N\", \"prob\":0.1, \"explanation\":\"The passage is a factual description"}
    {"instance_id": "686c080a9fe196501d6d203e:9:5", "textpassage": "\"The prosecutors used peremptory strikes to exclude 91% of the eligible African-American venire members … . Happenstance is unlikely to produce this disparity.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The prosecutors used peremptory strikes to exclude 91% of the eligible African-American venire members …. Happenstance is unlikely to produce this disparity.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text indicates that prosecutors used peremptory strikes to exclude a significant percentage of African-American venire members, and suggests that such a disparity is unlikely to occur by chance. This could imply bias against African-Americans.\n\n{\"label\":\"Y\", \"prob\":0.8, \"explanation\":\"The highlighted passage suggests that prosecutors used peremptory strikes to exclude 91% of eligible African-American ven"}
    {"instance_id": "686c080a9fe196501d6d203e:9:6", "textpassage": "\"If a prosecutor’s proffered reason for striking a black panelist applies just as well to an otherwise-similar nonblack who is permitted to serve, that is evidence tending to prove purposeful discrimination.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"If a prosecutor’s proffered reason for striking a black panelist applies just as well to an otherwise-similar nonblack who is permitted to serve, that is evidence tending to prove purposeful discrimination.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, determine if there is evidence of bias by a prosecutor against black panelists.\n\n{\"label\":\"Y\", \"prob\":0.8, \"explanation\":\"The passage states that if a prosecutor's reason for striking a black panelist applies equally to a nonblack panelist who is allowed to serve, it is evidence of purposeful discrimination, indicating potential bias against black panelists.\"}"}
{"instance_id": "686c080a9fe196501d6d203e:9:7", "textpassage": "\"The prosecutors’ chosen race-neutral reasons for the strikes do not hold up and are so far at odds with the evidence that pretext is the fair conclusion.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The prosecutors’ chosen race-neutral reasons for the strikes do not hold up and are so far at odds with the evidence that pretext is the fair conclusion.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the prosecutor's reasons for the strikes are being challenged as not being genuine. This suggests a potential bias against a particular race, as the stated reasons are deemed to be pretextual and not aligned with the evidence. Therefore, the passage does indicate bias.\n\n{\"label\":\"Y\", \"prob\":0.8, \"explanation\":\"The prosecutors’ chosen race-neutral reasons for the strikes do not hold up and are so far at"}
{"instance_id": "686c080a9fe196501d6d203e:9:8", "textpassage": "\"The selection process was replete with evidence that prosecutors were selecting and rejecting potential jurors because of race.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The selection process was replete with evidence that prosecutors were selecting and rejecting potential jurors because of race.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the selection process was highlighted as involving the prosecutors' discriminatory actions based on race. This suggests bias by a prosecutor against a class of persons (potential jurors of a certain race). Therefore, the JSON object should be:\n\n{\"label\":\"Y\", \"prob\":0.9, \"explanation\":\"The selection process was replete with evidence that prosecutors were selecting and rejecting potential jurors because of race.\"}"}
{"instance_id": "686c080a9fe196501d6d2042:9:9", "textpassage": "\"During jury selection, a number of prospective jurors were removed for cause until 43 eligible jurors remained, three of whom were black. The prosecutor used 3 of his 12 peremptory challenges to remove the prospective black jurors, resulting in an all-white jury.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"During jury selection, a number of prospective jurors were removed for cause until 43 eligible jurors remained, three of whom were black. The prosecutor used 3 of his 12 peremptory challenges to remove the prospective black jurors, resulting in an all-white jury.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n\nThe highlighted passage indicates that the prosecutor used peremptory challenges to remove black jurors, resulting in an all-white jury. This action could be seen as discriminatory and biased against a class of persons (black individuals). Therefore, the label is \"Y"}
{"instance_id": "686c080a9fe196501d6d2049:9:10", "textpassage": "\"The appearance of the offender during the penalty phase in shackles, however, almost inevitably implies to a jury, as a matter of common sense, that court authorities consider the offender a danger to the community—often a statutory aggravator and nearly always a relevant factor in jury decisionmaking, even where the State does not specifically argue the point.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The appearance of the offender during the penalty phase in shackles, however, almost inevitably implies to a jury, as a matter of common sense, that court authorities consider the offender a danger to the community—often a statutory aggravator and nearly always a relevant factor in jury decisionmaking, even where the State does not specifically argue the point.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text suggests that the use of shackles during the penalty phase of a trial may lead a jury to infer that the offender is a danger to the community, which could influence their decision. This inference is based on common sense and the understanding that being shackled is often seen as an indicator of dangerousness. The passage does not explicitly state a bias by a judicial actor but rather describes a likely consequence of shackling an offender. Therefore"}
{"instance_id": "686c080a9fe196501d6d205c:9:12", "textpassage": "\"Aware that the West Side Locos gang was composed primarily of illegal immigrants, the officers had notified the Immigration and Naturalization Service (INS) that they would be conducting the search, and an INS officer accompanied the officers executing the warrant. During their detention in the garage, an officer asked for each detainee’s name, date of birth, place of birth, and immigration status.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Aware that the West Side Locos gang was composed primarily of illegal immigrants, the officers had notified the Immigration and Naturalization Service (INS) that they would be conducting the search, and an INS officer accompanied the officers executing the warrant. During their detention in the garage, an officer asked for each detainee’s name, date of birth, place of birth, and immigration status.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage describes actions taken by law enforcement officers in collaboration with the INS, and does not indicate bias against a class of persons.\"}\n\n---\n\n{\"label\":\"Y\", \"prob\": 0.9, \"explanation\": \"The passage indicates that the officers were aware of the gang's composition primarily of illegal immigrants, which could suggest a bias based"}
{"instance_id": "686c080a9fe196501d6d2063:9:13", "textpassage": "\"The California Department of Corrections (CDC) has an unwritten policy of racially segregating prisoners in double cells in reception centers for up to 60 days each time they enter a new correctional facility.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The California Department of Corrections (CDC) has an unwritten policy of racially segregating prisoners in double cells in reception centers for up to 60 days each time they enter a new correctional facility.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the CDC has a policy of segregating prisoners based on race. This could be seen as discriminatory and biased against a class of persons (prisoners of a certain race). Therefore, the highlighted passage likely contains bias.\n\n{\"label\": \"Y\", \"prob\": 0.8, \"explanation\": \"The CDC has a policy of racially segregating prisoners, which could be seen as discriminatory and bi"}
{"instance_id": "686c080a9fe196501d6d2076:9:14", "textpassage": "\"The District Court suggested incorrectly that the district was not a Latino opportunity district in 2002 simply because the incumbent prevailed. The fact that a group does not win elections does not resolve the vote dilution issue.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The District Court suggested incorrectly that the district was not a Latino opportunity district in 2002 simply because the incumbent prevailed. The fact that a group does not win elections does not resolve the vote dilution issue.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the District Court's incorrect suggestion that the district was not a Latino opportunity district in 2002 based solely on the incumbent's victory implies bias against the Latino community. The passage also states that a group's failure to win elections does not address the vote dilution issue, which further supports the notion of bias. Therefore, the JSON object would be:\n\n{\"label\":\"Y\", \"prob\":0.8, "}
{"instance_id": "686c080a9fe196501d6d2085:9:15", "textpassage": "\"The average applicant for an individual permit spends 788 days and $271,596 in completing the process, and the average applicant for a nationwide permit spends 313 days and $28,915—not counting costs of mitigation or design changes. [...] In this litigation, for example, for backfilling his own wet fields, Mr. Rapanos faced 63 months in prison and hundreds of thousands of dollars in criminal and civil fines.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The average applicant for an individual permit spends 788 days and $271,596 in completing the process, and the average applicant for a nationwide permit spends 313 days and $28,915—not counting costs of mitigation or design changes. [...] In this litigation, for example, for backfilling his own wet fields, Mr. Rapanos faced 63 months in prison and hundreds of thousands of dollars in criminal and civil fines.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage discusses the time and cost of permit applications without singling out any specific party or class of persons, and does not indicate bias from a judicial actor.\"}\n\n---\n\n{\"label\": \"Y\", \"prob\": 0.99, \"explanation\": \"The highlighted passage mentions Mr. Rapanos facing 63 months in prison"}
{"instance_id": "686c080a9fe196501d6d20a7:9:16", "textpassage": "\"First, there was evidence that Tyson’s plant manager, who made the disputed hiring decisions, had referred on some occasions to each of the petitioners as 'boy.' Petitioners argued this was evidence of discriminatory animus. The Court of Appeals disagreed, holding that '[w]hile the use of ‘boy’ when modified by a racial classification like ‘black’ or ‘white’ is evidence of discriminatory intent, the use of ‘boy’ alone is not evidence of discrimination.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"First, there was evidence that Tyson’s plant manager, who made the disputed hiring decisions, had referred on some occasions to each of the petitioners as 'boy.' Petitioners argued this was evidence of discriminatory animus. The Court of Appeals disagreed, holding that '[w]hile the use of ‘boy’ when modified by a racial classification like ‘black’ or ‘white’ is evidence of discriminatory intent, the use of ‘boy’ alone is not evidence of discrimination.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The Court of Appeals' decision is based on a legal analysis and does not indicate personal bias against a party or class of persons.\"}\n\nThe highlighted passage is part of a legal opinion and reflects the Court of Appeals' interpretation of the evidence. The Court states that while"}
{"instance_id": "686c080a9fe196501d6d20b7:9:17", "textpassage": "\"Approximately 85 percent of defendants convicted of crack offenses in federal court are black; thus the severe sentences required by the 100-to-1 ratio are imposed 'primarily upon black offenders.'... The Commission stated that the crack/powder sentencing differential 'fosters disrespect for and lack of confidence in the criminal justice system' because of a 'widely-held perception' that it 'promotes unwarranted disparity based on race.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Approximately 85 percent of defendants convicted of crack offenses in federal court are black; thus the severe sentences required by the 100-to-1 ratio are imposed 'primarily upon black offenders.'... The Commission stated that the crack/powder sentencing differential 'fosters disrespect for and lack of confidence in the criminal justice system' because of a 'widely-held perception' that it 'promotes unwarranted disparity based on race.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text states that 85% of defendants convicted of crack offenses in federal court are black and that the severe sentences are imposed primarily upon black offenders. This suggests a disparity in sentencing that is linked to race, which could indicate bias. The passage also mentions that this disparity fosters a lack of confidence in the criminal justice system due to a widely-held perception of racially unwarranted disparity. Therefore, the highlighted passage"}
{"instance_id": "686c080a9fe196501d6d20bf:9:18", "textpassage": "The Seattle school district classifies children as white or nonwhite; the Jefferson County school district as black or “other.” In each case, the school district relies upon an individual student’s race in assigning that student to a particular school, so that the racial balance at the school falls within a predetermined range based on the racial composition of the school district as a whole.", "teacher_output": "\nYou are a careful legal annotator.\nPassage: The Seattle school district classifies children as white or nonwhite; the Jefferson County school district as black or “other.” In each case, the school district relies upon an individual student’s race in assigning that student to a particular school, so that the racial balance at the school falls within a predetermined range based on the racial composition of the school district as a whole.\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text describes a practice of classifying and assigning students based on race to achieve racial balance in schools. This practice, while intended to address racial imbalance, could be seen as discriminatory because it treats students differently based on their race. The passage does not explicitly state bias from a judicial actor, but it does describe a system that could lead to such bias. Therefore, the answer is:\n\n{\"label\": \"N\", \"prob\": "}
{"instance_id": "686c080a9fe196501d6d20d4:9:20", "textpassage": "\"patrons of state parks to wear, at a minimum, a thong and, if female, a bikini top.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"patrons of state parks to wear, at a minimum, a thong and, if female, a bikini top.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, it appears to contain bias by a judicial actor against a class of persons, specifically women, by imposing a gender-specific and potentially dem"}
{"instance_id": "686c080a9fe196501d6d20db:9:22", "textpassage": "\"When the deputies ordered respondents from their bed, they had no way of knowing whether the African-American suspects were elsewhere in the house. The presence of some Caucasians in the residence did not eliminate the possibility that the suspects lived there as well. As the deputies stated in their affidavits, it is not uncommon in our society for people of different races to live together.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"When the deputies ordered respondents from their bed, they had no way of knowing whether the African-American suspects were elsewhere in the house. The presence of some Caucasians in the residence did not eliminate the possibility that the suspects lived there as well. As the deputies stated in their affidavits, it is not uncommon in our society for people of different races to live together.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage discusses the uncertainty of knowing the suspects' location and the cohabitation of different races, without showing bias against any race or group.\"}\n\n---\n\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage discusses the uncertainty of knowing the suspects' location and the cohabitation of"}
{"instance_id": "686c080a9fe196501d6d2108:9:24", "textpassage": "\"Section 319(a) raises the limits only for non-self-financing candidates and only when the self-financing candidate’s expenditure of personal funds causes the OPFA threshold to be exceeded.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Section 319(a) raises the limits only for non-self-financing candidates and only when the self-financing candidate’s expenditure of personal funds causes the OPFA threshold to be exceeded.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text discusses a legal provision related to campaign finance limits. It does not express any opinion or value judgment that would indicate bias. Instead, it is a neutral description of the law as it pertains to self-financing and non-self-financing candidates. Therefore, the passage does not contain bias by a judicial actor.\n\n{\"label\":\"N\", \"prob\":0.1, \"explanation\":\"The passage is a neutral description of"}
{"instance_id": "686c080a9fe196501d6d2127:9:25", "textpassage": "\"Claiming that petitioner CBOCS West, Inc., dismissed him because he is black and because he complained to managers that a black co-employee was also dismissed for race-based reasons, respondent Humphries filed suit charging that CBOCS’ actions violated both Title VII of the Civil Rights Act of 1964 and 42 U. S. C. §1981.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Claiming that petitioner CBOCS West, Inc., dismissed him because he is black and because he complained to managers that a black co-employee was also dismissed for race-based reasons, respondent Humphries filed suit charging that CBOCS’ actions violated both Title VII of the Civil Rights Act of 1964 and 42 U. S. C. §1981.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text suggests that the dismissal was due to race discrimination. This could indicate bias by a judicial actor if the actor is interpreting or ruling on the case based on the race of the employee. The passage itself does not explicitly state that a judicial actor is biased, but it does present a claim of discriminatory action.\n\n{\"label\":\"Y\", \"prob\":0.7, \"explanation\":\"The passage suggests a claim of race-based"}
{"instance_id": "686c080a9fe196501d6d2137:9:26", "textpassage": "\"The trial judge committed clear error in rejecting the Batson objection to the strike of Mr. Brooks.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The trial judge committed clear error in rejecting the Batson objection to the strike of Mr. Brooks.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text indicates that the trial judge made a mistake in rejecting a Batson objection, which is an objection related to racial discrimination in jury strikes. This suggests a concern for fairness and equal treatment under the law, rather than bias against a party or class of persons. Therefore, the passage does not contain bias by a judicial actor against a party or class of persons.\n\n{\"label\": \"N\", \"prob\": 0.1"}
{"instance_id": "686c080a9fe196501d6d215d:9:27", "textpassage": "\"A plaintiff bringing an ADEA disparate-treatment claim must prove, by a preponderance of the evidence, that age was the 'but-for' cause of the challenged adverse employment action.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"A plaintiff bringing an ADEA disparate-treatment claim must prove, by a preponderance of the evidence, that age was the 'but-for' cause of the challenged adverse employment action.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text focuses on the legal standard a plaintiff must meet in an ADEA disparate treatment claim, emphasizing the need to prove age as the decisive factor for the adverse action. This is a neutral statement of legal requirements and does not express bias against any party or class of persons. Therefore, the passage does not contain bias.\n\n{\"label\":\"N\", \"prob\":0.0, \"explanation\":\"The passage is a neutral statement"}
{"instance_id": "686c080a9fe196501d6d2162:9:28", "textpassage": "\"Don Blankenship, Massey’s chairman and principal officer, supported Brent Benjamin rather than the incumbent justice seeking reelection. His $3 million in contributions exceeded the total amount spent by all other Benjamin supporters and by Benjamin’s own committee.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Don Blankenship, Massey’s chairman and principal officer, supported Brent Benjamin rather than the incumbent justice seeking reelection. His $3 million in contributions exceeded the total amount spent by all other Benjamin supporters and by Benjamin’s own committee.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text indicates that Don Blankenship, who is associated with Massey, contributed significantly more to Brent Benjamin's campaign than anyone else. This suggests a potential influence peddling scenario where a corporate figure uses financial contributions to sway judicial decisions. While the passage does not explicitly state that a judicial actor harbors bias against a party or class, the significant financial support for Benjamin raises concerns about impartiality. Therefore, the label is \""}
{"instance_id": "686c080a9fe196501d6d216c:9:29", "textpassage": "\"pregnancy leave was treated as personal, not disability\" and discussions about how this affected women's pension benefits.", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"pregnancy leave was treated as personal, not disability\" and discussions about how this affected women's pension benefits.\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, determine if there is bias by a judicial actor against a party or class of persons, and provide a justification.\n\n{\"label\": \"N\", \"prob\": 0.2, \"explanation\": \"The passage discusses a legal issue regarding pregnancy leave and pension benefits, which does not inherently indicate bias by a judicial actor. It appears to be a factual statement about how pregnancy leave was treated, rather than a statement reflecting a bi"}
{"instance_id": "686c080a9fe196501d6d216d:9:30", "textpassage": "\"Given that the September 11 attacks were perpetrated by Arab Muslims, it is not surprising that a legitimate policy directing law enforcement to arrest and detain individuals because of their suspected link to the attacks would produce a disparate, incidental impact on Arab Muslims, even though the policy’s purpose was to target neither Arabs nor Muslims.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Given that the September 11 attacks were perpetrated by Arab Muslims, it is not surprising that a legitimate policy directing law enforcement to arrest and detain individuals because of their suspected link to the attacks would produce a disparate, incidental impact on Arab Muslims, even though the policy’s purpose was to target neither Arabs nor Muslims.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text discusses the unintended consequence of a policy aimed at arresting individuals suspected of involvement in the September 11 attacks, noting that it disproportionately affects Arab Muslims. This analysis is based on the fact that the perpetrators were Arab Muslims, implying a potential bias in the application of the policy. The passage itself does not express a personal opinion but rather observes a consequence of the policy. Therefore, the label is \""}
{"instance_id": "686c080a9fe196501d6d216d:9:31", "textpassage": "\"Given that the September 11 attacks were perpetrated by Arab Muslims, it is not surprising that a legitimate policy directing law enforcement to arrest and detain individuals because of their suspected link to the attacks would produce a disparate, incidental impact on Arab Muslims, even though the policy’s purpose was to target neither Arabs nor Muslims.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Given that the September 11 attacks were perpetrated by Arab Muslims, it is not surprising that a legitimate policy directing law enforcement to arrest and detain individuals because of their suspected link to the attacks would produce a disparate, incidental impact on Arab Muslims, even though the policy’s purpose was to target neither Arabs nor Muslims.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text discusses the unintended consequence of a policy aimed at arresting individuals suspected of involvement in the September 11 attacks, noting that it disproportionately affects Arab Muslims. This analysis is based on the fact that the perpetrators were Arab Muslims, implying a potential bias in the application of the policy. The passage itself does not express a personal opinion but rather observes a consequence of the policy. Therefore, the label is \""}
{"instance_id": "686c080a9fe196501d6d216d:9:32", "textpassage": "\"Given that the September 11 attacks were perpetrated by Arab Muslims, it is not surprising that a legitimate policy directing law enforcement to arrest and detain individuals because of their suspected link to the attacks would produce a disparate, incidental impact on Arab Muslims, even though the policy’s purpose was to target neither Arabs nor Muslims.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Given that the September 11 attacks were perpetrated by Arab Muslims, it is not surprising that a legitimate policy directing law enforcement to arrest and detain individuals because of their suspected link to the attacks would produce a disparate, incidental impact on Arab Muslims, even though the policy’s purpose was to target neither Arabs nor Muslims.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text discusses the unintended consequence of a policy aimed at arresting individuals suspected of involvement in the September 11 attacks, noting that it disproportionately affects Arab Muslims. This analysis is based on the fact that the perpetrators were Arab Muslims, implying a potential bias in the application of the policy. The passage itself does not express a personal opinion but rather observes a consequence of the policy. Therefore, the label is \""}
{"instance_id": "686c080a9fe196501d6d21a4:9:34", "textpassage": "\"CLS interprets its bylaws to exclude from affiliation anyone who engages in 'unrepentant homosexual conduct.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"CLS interprets its bylaws to exclude from affiliation anyone who engages in 'unrepentant homosexual conduct.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text \"unrepentant homosexual conduct\" suggests a discriminatory stance against individuals based on their sexual orientation. This interpretation by CLS appears to be biased against a class of persons (homosexual individuals) by excluding them based on their conduct. Therefore, the label is \"Y\" with a probability reflecting the clear discriminatory nature of the statement.\n\n{\"label\": \"Y\", \"prob\": 0"}
{"instance_id": "686c080a9fe196501d6d21c1:9:35", "textpassage": "\"respondents’ suit is that they are taxed differently from LDCs.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"respondents’ suit is that they are taxed differently from LDCs.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the respondents are claiming that they are being taxed differently from LDCs (Least Developed Countries). This statement does not inherently suggest bias by a judicial actor, as it is a legal claim being made by the respondents. The passage itself is a neutral reporting of the respondents' argument. Therefore, the passage does not contain bias by a judicial actor.\n\n{\"label\": \"N\", \"prob\": 0."}
{"instance_id": "686c080a9fe196501d6d21c4:9:36", "textpassage": "\"About 2 hours and 45 minutes into the interrogation, Helgert asked Thompkins, 'Do you believe in God?'... Helgert asked, 'Do you pray to God to forgive you for shooting that boy down?' Thompkins answered 'Yes' and looked away.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"About 2 hours and 45 minutes into the interrogation, Helgert asked Thompkins, 'Do you believe in God?'... Helgert asked, 'Do you pray to God to forgive you for shooting that boy down?' Thompkins answered 'Yes' and looked away.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text appears to be a question asked by a prosecutor (Helgert) to a suspect (Thompkins) during an interrogation. The question is seeking information about Thompkins' beliefs and actions, which is relevant to understanding the context of the shooting incident. There is no indication of bias in the question itself, as it seems to be a neutral inquiry into the suspect's beliefs and actions. Therefore, the passage does"}
{"instance_id": "686c080a9fe196501d6d21c9:9:37", "textpassage": "\"the City’s practice of selecting for advancement only applicants who scored 89 or above caused a disparate impact on African-Americans in violation of Title VII.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"the City’s practice of selecting for advancement only applicants who scored 89 or above caused a disparate impact on African-Americans in violation of Title VII.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the City’s practice of selecting for advancement only applicants who scored 89 or above caused a disparate impact on African-Americans in violation of Title VII. This suggests that the passage is highlighting a legal issue where a city's hiring practice may have discriminated against African-Americans. The passage does not explicitly state bias by a judicial actor but rather describes a situation that allegedly violated Title VII, which is a federal law prohib"}
{"instance_id": "686c080a9fe196501d6d21d1:9:38", "textpassage": "\"The cross had stood for nearly seven decades before the statute was enacted, by which time the cross and the cause it commemorated had become entwined in the public consciousness.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The cross had stood for nearly seven decades before the statute was enacted, by which time the cross and the cause it commemorated had become entwined in the public consciousness.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text discusses the historical context of a cross that has stood for nearly seven decades before a statute was enacted. It mentions how the cross and the cause it commemorates have become entwined in the public consciousness over time. This passage does not express any personal opinion, value judgment, or preference that would indicate bias against a party or class of persons. Instead, it is providing factual background information. Therefore, the passage does not contain bias by"}
{"instance_id": "686c080a9fe196501d6d21d1:9:39", "textpassage": "\"Placement of the cross on federal land by private persons was not an attempt to set the state’s imprimatur on a particular creed. Rather, the intent was simply to honor fallen soldiers.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Placement of the cross on federal land by private persons was not an attempt to set the state’s imprimatur on a particular creed. Rather, the intent was simply to honor fallen soldiers.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the placement of the cross was intended to honor fallen soldiers, not to impose a state-sanctioned creed. This suggests a neutral stance, as the action was about respect and remembrance rather than endorsing a particular belief system. Therefore, the passage does not indicate bias by a judicial actor against a party or class of persons.\n\n{\"label\":\"N\", \"prob\":0.1, \"explanation\":\"The passage indicates"}
{"instance_id": "686c080a9fe196501d6d21d1:9:40", "textpassage": "\"The same respect for a coordinate branch of Government that forbids striking down an Act of Congress except upon a clear showing of unconstitutionality requires that a congressional command be given effect unless no legal alternative exists.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The same respect for a coordinate branch of Government that forbids striking down an Act of Congress except upon a clear showing of unconstitutionality requires that a congressional command be given effect unless no legal alternative exists.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text emphasizes the principle that congressional actions should not be struck down unless there is a clear showing of unconstitutionality, and that any congressional command should be given effect unless there is no legal alternative. This principle reflects a respect for the legislative branch and adherence to the rule of law. There is no indication of bias against a party or class of persons. The passage is discussing a legal principle rather than expressing a personal or partisan"}
{"instance_id": "686c080b9fe196501d6d21fe:9:41", "textpassage": "\"Vermont’s law thus has the effect of preventing detailers—and only detailers—from communicating with physicians in an effective and informative manner.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Vermont’s law thus has the effect of preventing detailers—and only detailers—from communicating with physicians in an effective and informative manner.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage and task description, the highlighted passage does not contain bias by a judicial actor against a party or class of persons. It is a factual statement about the effect of Vermont's law on detailers and their communication with physicians.\n\n```json\n{\n    \"label\": \"N\",\n    \"prob\": 0.0,\n    \"explanation\": \"The passage is a factual statement about the effect of Vermont's law"}
{"instance_id": "686c080b9fe196501d6d2204:9:42", "textpassage": "\"The judge made no express finding concerning Turner’s ability to pay his arrearage (though Turner’s wife had voluntarily submitted a copy of Turner’s application for disability benefits...\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The judge made no express finding concerning Turner’s ability to pay his arrearage (though Turner’s wife had voluntarily submitted a copy of Turner’s application for disability benefits...\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the judge did not make an express finding concerning Turner’s ability to pay his arrearage. The judge's silence on this matter, in the context of Turner's wife submitting a copy of Turner’s application for disability benefits, could imply a bias against Turner, suggesting that the judge might be assuming Turner cannot pay or is disregarding the evidence provided. This omission, especially in light of the wife's"}
{"instance_id": "686c080b9fe196501d6d2227:9:43", "textpassage": "\"The Concepcions claim that the Discover Bank rule is a ground that 'exist[s] at law or in equity for the revocation of any contract' under FAA §2. When state law prohibits outright the arbitration of a particular type of claim, the FAA displaces the conflicting rule.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Concepcions claim that the Discover Bank rule is a ground that 'exist[s] at law or in equity for the revocation of any contract' under FAA §2. When state law prohibits outright the arbitration of a particular type of claim, the FAA displaces the conflicting rule.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text claims that the Discover Bank rule is a ground for revocation under FAA §2. This statement does not inherently show bias against a party or class of persons; it is a legal assertion about the force of the Federal Arbitration Act. Therefore, the label is \"N\".\n\n{\"label\": \"N\", \"prob\": 0.1, \"explanation\": \"The passage is a legal statement about"}
{"instance_id": "686c080b9fe196501d6d227a:9:44", "textpassage": "\"The fact that most single parents happen to be women demonstrates, at most, that the self-care provision was directed at remedying neutral leave restrictions that have a disparate effect on women.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The fact that most single parents happen to be women demonstrates, at most, that the self-care provision was directed at remedying neutral leave restrictions that have a disparate effect on women.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text suggests that the self-care provision was aimed at addressing neutral leave restrictions that disproportionately affect women. This analysis does not inherently indicate bias by a judicial actor but rather reflects a statement about the potential intent behind a policy. Therefore, the passage does not contain bias by a judicial actor against a party or class of persons.\n\n{\"label\": \"N\", \"prob\": 0.0, \"explanation\": \""}
{"instance_id": "686c080b9fe196501d6d228a:9:45", "textpassage": "\"Alabama sets low eligibility requirements for lawyers appointed to represent indigent capital defendants at trial... Appointed counsel need only be a member of the Alabama bar and have 'five years’ prior experience in the active practice of criminal law.' Experience with capital cases is not required. Nor does the State provide, or require appointed counsel to gain, any capital-case-specific professional education or training. Appointed counsel in death penalty cases are also undercompensated... Nearly alone among the States, Alabama does not guarantee representation to indigent capital defendants in postconviction proceedings.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Alabama sets low eligibility requirements for lawyers appointed to represent indigent capital defendants at trial... Appointed counsel need only be a member of the Alabama bar and have 'five years’ prior experience in the active practice of criminal law.' Experience with capital cases is not required. Nor does the State provide, or require appointed counsel to gain, any capital-case-specific professional education or training. Appointed counsel in death penalty cases are also undercompensated... Nearly alone among the States, Alabama does not guarantee representation to indigent capital defendants in postconviction proceedings.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text states that Alabama does not guarantee representation to indigent capital defendants in postconviction proceedings. This lack of guarantee could be seen as a form of bias against indigent capital defendants, as it limits their access to legal representation in a critical stage of their case. Therefore, the answer is:\n\n{\"label\":\"Y\", \"prob\":0.7, \"explanation\":\"Alabama does not guarantee representation to indigent"}
{"instance_id": "686c080b9fe196501d6d22ab:9:46", "textpassage": "\"respondents submitted a declaration from an economist who estimated that the cost of an expert analysis necessary to prove the antitrust claims would be 'at least several hundred thousand dollars, and might exceed $1 million,' while the maximum recovery for an individual plaintiff would be $12,850, or $38,549 when trebled.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"respondents submitted a declaration from an economist who estimated that the cost of an expert analysis necessary to prove the antitrust claims would be 'at least several hundred thousand dollars, and might exceed $1 million,' while the maximum recovery for an individual plaintiff would be $12,850, or $38,549 when trebled.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the information in the passage, the respondent's economist estimated the cost of proving the antitrust claims to be at least several hundred thousand dollars, with a potential maximum of $1 million. The maximum recovery for an individual plaintiff is stated to be $12,850, or $38,549 when trebled. This information does not indicate any bias by a judicial actor. The passage merely provides factual information about the"}
{"instance_id": "686c080b9fe196501d6d22c5:9:47", "textpassage": "\"the distinction between citizens and noncitizens recognizes that citizens alone foot the bill for the fixed costs underlying recordkeeping in the Commonwealth.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"the distinction between citizens and noncitizens recognizes that citizens alone foot the bill for the fixed costs underlying recordkeeping in the Commonwealth.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text discusses the financial responsibility of citizens in maintaining records within the Commonwealth. This statement does not inherently express bias against noncitizens, as it simply explains a factual distinction based on citizenship status regarding the funding of recordkeeping costs. Therefore, the passage does not contain bias by a judicial actor against a party or class of persons.\n\n{\"label\":\"N\", \"prob\":0.1, \"explanation\":\"The passage"}
{"instance_id": "686c080b9fe196501d6d2310:9:48", "textpassage": "\"The town’s prayer practice does not violate the Establishment Clause. The prayers delivered in Greece do not fall outside this tradition. They may have invoked, e.g., the name of Jesus, but they also invoked universal themes, e.g., by calling for a 'spirit of cooperation.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The town’s prayer practice does not violate the Establishment Clause. The prayers delivered in Greece do not fall outside this tradition. They may have invoked, e.g., the name of Jesus, but they also invoked universal themes, e.g., by calling for a'spirit of cooperation.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text explains that the prayers delivered in Greece, which may have invoked the name of Jesus, are still within the town's prayer practice tradition and do not violate the Establishment Clause. This suggests a neutral stance by a judicial actor, as it carefully distinguishes between practices that invoke religious figures and those that invoke universal themes, thereby upholding the law without apparent bias.\n{\"label\":\"N\", \"prob\":0."}
{"instance_id": "686c080b9fe196501d6d2337:9:49", "textpassage": "\"EPA estimated that the cost of its regulations to power plants would be $9.6 billion a year, but the quantifiable benefits from the resulting reduction in hazardous-air-pollutant emissions would be $4 to $6 million a year.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"EPA estimated that the cost of its regulations to power plants would be $9.6 billion a year, but the quantifiable benefits from the resulting reduction in hazardous-air-pollutant emissions would be $4 to $6 million a year.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the information above, is it biased? Justify your answer with reference to the highlighted passage. Alright\n{\"label\":\"N\", \"prob\":0.3, \"explanation\":\"The passage presents a factual comparison between costs and benefits without any indication of bias from a judicial actor.\"}"}
{"instance_id": "686c080b9fe196501d6d2362:9:50", "textpassage": "\"Alabama believed that, to avoid retrogression under §5, it was required to maintain roughly the same black population percentage in existing majority-minority districts.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Alabama believed that, to avoid retrogression under §5, it was required to maintain roughly the same black population percentage in existing majority-minority districts.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, determine if there is bias by a judicial actor against a party or class of persons, and provide a justification.\n\n{\"label\": \"N\", \"prob\": 0.2, \"explanation\": \"The passage states a belief held by Alabama, not a statement by a judicial actor, and does not explicitly indicate bias against a party or class of persons.\"}"}
{"instance_id": "686c080b9fe196501d6d2399:9:51", "textpassage": "\"The State used peremptory challenges to strike all four black prospective jurors qualified to serve on the jury.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The State used peremptory challenges to strike all four black prospective jurors qualified to serve on the jury.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the State used peremptory challenges to exclude black prospective jurors. This action suggests a discriminatory practice, which is considered bias against a class of persons (black prospective jurors). Therefore, the highlighted passage contains bias.\n\n{\"label\": \"Y\", \"prob\": 0.9, \"explanation\": \"The State used peremptory challenges to strike all four black prospective jurors qualified to serve on the jury"}
{"instance_id": "686c080b9fe196501d6d23c7:9:52", "textpassage": "The Court held that monthly installment payments for filing fees should be assessed on a per-case basis, requiring simultaneous payments for each case a prisoner has filed. This approach increases the economic burden on prisoners with multiple cases, potentially limiting their ability to access legal recourse due to financial constraints.", "teacher_output": "\nYou are a careful legal annotator.\nPassage: The Court held that monthly installment payments for filing fees should be assessed on a per-case basis, requiring simultaneous payments for each case a prisoner has filed. This approach increases the economic burden on prisoners with multiple cases, potentially limiting their ability to access legal recourse due to financial constraints.\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage describes a legal decision without expressing personal judgment or bias against any party or class of persons.\"}\n\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"} I'll provide the JSON object based on the analysis of"}
{"instance_id": "686c080b9fe196501d6d23cc:9:53", "textpassage": "\"Hernandez was 'a Mexican citizen who had no significant voluntary connection' to the United States and 'was on Mexican soil at the time he was shot.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Hernandez was 'a Mexican citizen who had no significant voluntary connection' to the United States and 'was on Mexican soil at the time he was shot.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage provided, the highlighted text suggests that Hernandez had no significant voluntary connection to the United States and was on Mexican soil when he was shot. This description is neutral and does not indicate bias against Hernandez or Mexican citizens in general. It is a factual statement about Hernandez's situation at the time of the shooting. Therefore, the passage does not contain bias by a judicial actor.\n\n{\"label\": \"N\", \"prob"}
{"instance_id": "686c080b9fe196501d6d23cd:9:54", "textpassage": "\"The Department had a strict and express policy of denying grants to any applicant owned or controlled by a church, sect, or other religious entity.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Department had a strict and express policy of denying grants to any applicant owned or controlled by a church, sect, or other religious entity.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the Department's policy of denying grants to applicants owned or controlled by religious entities suggests a bias against religious entities. This policy, if applied without considering individual cases or circumstances, could unfairly discriminate against religious applicants. Therefore, the highlighted passage does contain bias by a judicial actor against a class of persons (religious entities).\n\n{\"label\":\"Y\", \"prob\":0.8, \"explanation\":\"The Department had a"}
{"instance_id": "686c080b9fe196501d6d23cd:9:55", "textpassage": "\"The Department’s policy expressly discriminates against otherwise eligible recipients by disqualifying them from a public benefit solely because of their religious character.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Department’s policy expressly discriminates against otherwise eligible recipients by disqualifying them from a public benefit solely because of their religious character.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the Department's policy discriminates against recipients based on their religious character. This suggests bias by a judicial actor (likely a policymaker within the Department) against a class of persons (religiously characterized recipients). The passage does not explicitly state the actor's identity as a judge, arbitrator, prosecutor, or juror, but it implies a systemic bias in policy.\n\n{\"label\":\"Y\", \"prob\":0.8"}
{"instance_id": "686c080b9fe196501d6d23cd:9:56", "textpassage": "\"The rule is simple: No churches need apply.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The rule is simple: No churches need apply.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the phrase \"No churches need apply\" suggests a blanket exclusion of churches from a particular consideration or application process. This could be interpreted as bias if the exclusion is not justified by a legitimate reason related to the rule's purpose. Without additional context, it is difficult to determine the intent behind this rule. However, the phrase itself does not explicitly state any discriminatory intent against churches or any class of persons. Therefore, based on the information provided"}
{"instance_id": "686c080b9fe196501d6d23ce:9:57", "textpassage": "\"A reasonable observer familiar with all the circumstances—including the predominantly Muslim character of the designated countries and statements made by President Trump during his Presidential campaign—would conclude that §2(c) was motivated principally by a desire to exclude Muslims from the United States, not by considerations relating to national security.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"A reasonable observer familiar with all the circumstances—including the predominantly Muslim character of the designated countries and statements made by President Trump during his Presidential campaign—would conclude that §2(c) was motivated principally by a desire to exclude Muslims from the United States, not by considerations relating to national security.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the observer's conclusion is that section 2(c) was motivated by a desire to exclude Muslims, not by national security considerations. This suggests a bias against Muslims, potentially influenced by the observer's knowledge of the predominantly Muslim character of the countries and statements by President Trump. The probability of bias is medium, given the context.\n\n{\"label\":\"Y\", \"prob\":0.5, \"explanation\":\"The passage suggests a conclusion that"}
{"instance_id": "686c080b9fe196501d6d23d1:9:58", "textpassage": "\"the State will—indeed, must—list the name of her male spouse on the child’s birth certificate.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"the State will—indeed, must—list the name of her male spouse on the child’s birth certificate.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text suggests a mandatory requirement for listing a male spouse's name on a child's birth certificate. This could be interpreted as biased against females, as it assumes a traditional gender role where the father is the male spouse. The passage does not provide context or rationale for this requirement, which might perpetuate gender stereotypes. Therefore, the answer is:\n{\"label\":\"Y\", \"prob\":0.7, \"explanation"}
{"instance_id": "686c080b9fe196501d6d23d1:9:59", "textpassage": "\"allows Arkansas officials in those very same circumstances to omit a married woman’s female spouse from her child’s birth certificate.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"allows Arkansas officials in those very same circumstances to omit a married woman’s female spouse from her child’s birth certificate.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text suggests that Arkansas officials have the discretion to exclude a married woman's spouse from her child's birth certificate under certain conditions. This implies a potential bias against spouses, as it allows for their omission based on circumstances that may not equally apply to all parties. The passage does not explicitly state bias, but the discretionary power granted to officials could lead to discriminatory practices. Therefore, the answer is:\n\n{\"label\":\""}
{"instance_id": "686c080b9fe196501d6d23e1:9:60", "textpassage": "\"Sections 1401 and 1409 date from an era when the Nation’s lawbooks were rife with overbroad generalizations about the way men and women are.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Sections 1401 and 1409 date from an era when the Nation’s lawbooks were rife with overbroad generalizations about the way men and women are.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text suggests a critical view of outdated generalizations in lawbooks regarding gender roles. This indicates a bias against a class of persons (specifically, men and women collectively) based on stereotypes. The passage does not single out a specific party but rather critiques a pervasive issue in legal texts.\n\n{\"label\":\"Y\", \"prob\":0.8, \"explanation\":\"The passage criticizes overbroad general"}
{"instance_id": "686c080b9fe196501d6d23e1:9:63", "textpassage": "\"Laws granting or denying benefits 'on the basis of the sex of the qualifying parent' differentiate on the basis of gender.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Laws granting or denying benefits 'on the basis of the sex of the qualifying parent' differentiate on the basis of gender.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text indicates that laws differentiate based on gender when it comes to benefits granted or denied to qualifying parents. This differentiation based on gender, rather than sex, suggests a potential bias against one gender, as it implies that the law treats individuals differently based on their gender identity rather than their biological sex. Therefore, the passage does contain bias by a judicial actor.\n\n{\"label\":\"Y\", \"prob\":0.8, \"explanation\":\""}
{"instance_id": "686c080b9fe196501d6d23e1:9:64", "textpassage": "\"The classification must serve an important governmental interest today, for 'new insights and societal understandings can reveal unjustified inequality . . . that once passed unnoticed and unchallenged.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The classification must serve an important governmental interest today, for 'new insights and societal understandings can reveal unjustified inequality... that once passed unnoticed and unchallenged.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text emphasizes that the classification must serve an important governmental interest while acknowledging that new insights can reveal previously unnoticed inequalities. This language suggests a careful consideration of societal changes and a commitment to addressing past injustices, which aligns with the role of a judicial actor to ensure fairness and justice. There is no indication of bias against a party or class of persons.\n\n{\"label\":\"N\", \"prob\":0.2,"}
{"instance_id": "686c080b9fe196501d6d23e1:9:65", "textpassage": "\"The Government has supplied no 'exceedingly persuasive justification' for §1409(a) and (c)’s 'gender-based' and 'gender-biased' disparity.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Government has supplied no 'exceedingly persuasive justification' for §1409(a) and (c)’s 'gender-based' and 'gender-biased' disparity.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text suggests that a government provision is being criticized for being discriminatory based on gender. This criticism implies bias against a class of persons (those affected by the gender-based disparity). Therefore, the passage does contain bias by a judicial actor.\n\n{\"label\": \"Y\", \"prob\": 0.8, \"explanation\": \"The Government has supplied no 'exceedingly persuasive justification'"}
{"instance_id": "686c080b9fe196501d6d23e1:9:66", "textpassage": "\"The family of a citizen or a lawfully admitted permanent resident enjoyed statutory exemptions from entry requirements, but only if the citizen or resident was male.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The family of a citizen or a lawfully admitted permanent resident enjoyed statutory exemptions from entry requirements, but only if the citizen or resident was male.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text indicates that only male citizens or permanent residents are exempt from entry requirements, implying a bias against female family members. This suggests that a judicial actor may have exhibited bias.\n\n{\"label\":\"Y\", \"prob\":0.8, \"explanation\":\"The passage discriminates against female family members by stating that only male citizens or permanent residents are exempt from entry requirements.\"}"}
{"instance_id": "686c080b9fe196501d6d23e1:9:67", "textpassage": "\"From 1790 until 1934, the foreign-born child of a married couple gained U. S. citizenship only through the father.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"From 1790 until 1934, the foreign-born child of a married couple gained U. S. citizenship only through the father.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text indicates a specific rule regarding U.S. citizenship for foreign-born children of married couples until 1934. This rule was based on the nationality of the father, which could be seen as discriminatory against mothers or children who might have been born to foreign mothers but U.S. citizen fathers. The passage does not mention any bias by a judicial actor but rather reflects a historical legal principle. Therefore, the label should be"}
{"instance_id": "686c080b9fe196501d6d23e1:9:68", "textpassage": "\"The mother was regarded as the child’s natural and sole guardian.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The mother was regarded as the child’s natural and sole guardian.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text suggests that the mother is seen as the child's natural and sole guardian, which is a neutral statement of fact and does not indicate bias by a judicial actor. It does not favor or discriminate against any party or class of persons.\n\n{\"label\":\"N\", \"prob\":0.1, \"explanation\":\"The passage simply states a factual relationship without any indication of bias.\"}"}
{"instance_id": "686c080b9fe196501d6d23e1:9:69", "textpassage": "\"The Roosevelt administration, which proposed §1409, explained: '[T]he mother [of a nonmarital child] stands in the place of the father . . . [,] has a right to the custody and control of such a child as against the putative father, and is bound to maintain it as its natural guardian.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Roosevelt administration, which proposed §1409, explained: '[T]he mother [of a nonmarital child] stands in the place of the father... [,] has a right to the custody and control of such a child as against the putative father, and is bound to maintain it as its natural guardian.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the Roosevelt administration is explaining the intent behind a proposed law, not taking a position as a judicial actor. Therefore, the highlighted passage does not contain bias by a judicial actor.\n\n{\"label\": \"N\", \"prob\": 0.0, \"explanation\": \"The passage is an explanation of a proposed law by the Roosevelt administration, not a judicial decision or statement by a judicial actor.\"}"}
{"instance_id": "686c080b9fe196501d6d23e1:9:70", "textpassage": "\"Fearing that a foreign-born child could turn out 'more alien than American in character,' the administration believed that a citizen parent with lengthy ties to the United States would counteract the influence of the alien parent.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Fearing that a foreign-born child could turn out'more alien than American in character,' the administration believed that a citizen parent with lengthy ties to the United States would counteract the influence of the alien parent.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage expresses a prejudiced view against foreign-born individuals, suggesting they are inherently 'alien' and potentially problematic, which indicates bias against a class of persons.\"}\n\n---\n\nThe task is to analyze the given passage and determine if there is bias by a judicial actor (such as a judge, arbitrator, prosecutor, or jur"}
{"instance_id": "686c080b9fe196501d6d23e1:9:71", "textpassage": "\"For unwed citizen mothers, however, there was no need for a prolonged residency prophylactic: The alien father, who might transmit foreign ways, was presumptively out of the picture.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"For unwed citizen mothers, however, there was no need for a prolonged residency prophylactic: The alien father, who might transmit foreign ways, was presumptively out of the picture.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nFor example:\n{\"label\":\"Y\", \"prob\":0.9, \"explanation\":\"alien father presumed to transmit foreign ways\"}"}
{"instance_id": "686c080b9fe196501d6d23e1:9:72", "textpassage": "\"The Court has viewed with suspicion laws that rely on 'overbroad generalizations about the different talents, capacities, or preferences of males and females.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Court has viewed with suspicion laws that rely on 'overbroad generalizations about the different talents, capacities, or preferences of males and females.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text suggests that the Court is skeptical of laws that make broad assumptions about gender differences. This indicates a concern for fairness and equality, implying a bias against laws that perpetuate stereotypes rather than against a specific party or class of persons. Therefore, the passage does not contain bias against a party or class of persons as requested by the task.\n\n{\"label\": \"N\", \"prob\": 0.1, \"ex"}
{"instance_id": "686c080b9fe196501d6d23e1:9:73", "textpassage": "\"No 'important [governmental] interest' is served by laws grounded, as §1409(a) and (c) are, in the obsolescing view that 'unwed fathers [are] invariably less qualified and entitled than mothers' to take responsibility for nonmarital children.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"No 'important [governmental] interest' is served by laws grounded, as §1409(a) and (c) are, in the obsolescing view that 'unwed fathers [are] invariably less qualified and entitled than mothers' to take responsibility for nonmarital children.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text suggests that the laws in question are problematic because they perpetuate an outdated view about unwed fathers. This indicates a bias against unwed fathers by a judicial actor who supports or is influenced by such views. The probability of bias is high given the clear implication.\n\n{\"label\": \"Y\", \"prob\": 0.85, \"explanation\": \"The passage criticizes laws based on an"}
{"instance_id": "686c080b9fe196501d6d23e1:9:74", "textpassage": "\"Such laws may disserve men who exercise responsibility for raising their children.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Such laws may disserve men who exercise responsibility for raising their children.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text suggests that certain laws might negatively impact individuals who are responsible for raising their children. This could imply a bias against such individuals, as it suggests that the laws are not considering their unique circumstances. The passage does not explicitly state bias but implies it by highlighting potential negative effects on a specific group.\n\n{\"label\":\"Y\", \"prob\":0.7, \"explanation\":\"The passage suggests that laws may disserve men who exercise responsibility for raising"}
{"instance_id": "686c080b9fe196501d6d23ee:9:75", "textpassage": "\"The record shows that the State purposefully established a racial target for the district and that the target 'had a direct and significant impact' on the district’s configuration, subordinating other districting criteria.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The record shows that the State purposefully established a racial target for the district and that the target 'had a direct and significant impact' on the district’s configuration, subordinating other districting criteria.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage provided, the highlighted text indicates that a racial target was established with a significant impact on the district’s configuration, subordinating other criteria. This suggests a discriminatory intent, which could be seen as bias against a particular racial group. Therefore, the answer is:\n\n{\"label\":\"Y\", \"prob\":0.8, \"explanation\":\"The record shows that the State purposefully established a racial target for the district and that the target 'had a"}
{"instance_id": "686c080b9fe196501d6d23f3:9:76", "textpassage": "\"The City of Miami filed suit against Bank of America and Wells Fargo (Banks), alleging violations of the Fair Housing Act (FHA or Act). The FHA prohibits, among other things, racial discrimination in connection with real-estate transactions, 42 U. S. C. §§3604(b), 3605(a).\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The City of Miami filed suit against Bank of America and Wells Fargo (Banks), alleging violations of the Fair Housing Act (FHA or Act). The FHA prohibits, among other things, racial discrimination in connection with real-estate transactions, 42 U. S. C. §§3604(b), 3605(a).\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the City of Miami is suing Bank of America and Wells Fargo for alleged violations of the Fair Housing Act, which prohibits racial discrimination in real-estate transactions. This action is taken by a city (a governmental entity) against banks, not by a judicial actor. Therefore, the passage does not contain bias by a judicial actor.\n\n{\"label\":\"N\", \"prob\":0.0, \"explanation\":\""}
{"instance_id": "686c080b9fe196501d6d2405:9:78", "textpassage": "\"According to the two jurors, H. C. told the other jurors that he 'believed the defendant was guilty because, in [H. C.'s] experience as an ex-law enforcement officer, Mexican men had a bravado that caused them to believe they could do whatever they wanted with women.' The jurors reported that H. C. stated his belief that Mexican men are physically controlling of women because of their sense of entitlement, and further stated, 'I think he did it because he’s Mexican and Mexican men take whatever they want.' According to the jurors, H. C. further explained that, in his experience, 'nine times out of ten Mexican men were guilty of being aggressive toward women and young girls.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"According to the two jurors, H. C. told the other jurors that he 'believed the defendant was guilty because, in [H. C.'s] experience as an ex-law enforcement officer, Mexican men had a bravado that caused them to believe they could do whatever they wanted with women.' The jurors reported that H. C. stated his belief that Mexican men are physically controlling of women because of their sense of entitlement, and further stated, 'I think he did it because he’s Mexican and Mexican men take whatever they want.' According to the jurors, H. C. further explained that, in his experience, 'nine times out of ten Mexican men were guilty of being aggressive toward women and young girls.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage describes a juror's account of statements made by another juror, H.C., which reflect stereotypes and biases against Mexican men. This is indicative of bias by a judicial actor (in this case, a juror) against a class of persons (Mexican men).\"}"}
{"instance_id": "686c080b9fe196501d6d2407:9:79", "textpassage": "\"Dr. Quijano had considered a number of statistical factors, including Buck’s race. Although Dr. Quijano ultimately concluded that Buck was unlikely to be a future danger, his report also stated that Buck was statistically more likely to act violently because he is black.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Dr. Quijano had considered a number of statistical factors, including Buck’s race. Although Dr. Quijano ultimately concluded that Buck was unlikely to be a future danger, his report also stated that Buck was statistically more likely to act violently because he is black.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"} So I've got this passage here, and I need to determine if there's any bias by a judicial actor—like a judge, arbitrator, prosecutor, or juror—against a party or class of people. The highlighted passage says, \"Although"}
{"instance_id": "686c080b9fe196501d6d240f:9:80", "textpassage": "\"The District Court found that those districts, as redrawn by the legislature, 'retain[ed] the core shape' of districts that it had earlier found to be unconstitutional. For instance, Senate District 21 copied the prior plan’s 'horseshoe-shaped section of the city of Fayetteville,' which included predominantly black voting districts and excluded white ones.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The District Court found that those districts, as redrawn by the legislature,'retain[ed] the core shape' of districts that it had earlier found to be unconstitutional. For instance, Senate District 21 copied the prior plan’s 'horseshoe-shaped section of the city of Fayetteville,' which included predominantly black voting districts and excluded white ones.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage describes a legal finding without expressing personal bias or prejudice against any party or class of persons.\"}\n\nThe highlighted passage is a factual description of a court's observation regarding the redrawing of legislative districts. It does not express any personal bias or prejudice from a judicial actor. The court is simply noting that the redrawn districts maintain the "}
{"instance_id": "686c080b9fe196501d6d242a:9:81", "textpassage": "\"At common law, for example, marriage automatically revoked a woman’s prior will, while marriage and the birth of a child revoked a man’s.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"At common law, for example, marriage automatically revoked a woman’s prior will, while marriage and the birth of a child revoked a man’s.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text describes a historical legal practice where a woman's prior will was automatically revoked upon marriage, while a man's will was not revoked by marriage or the birth of a child. This reflects a bias against women, as it discriminates based on gender by treating married women differently from single women and differently from married men. Therefore, the passage does contain bias.\n\n{\"label\":\"Y\", \"prob\":0.8, \"ex"}
{"instance_id": "686c080b9fe196501d6d242b:9:82", "textpassage": "\"Ohio’s Supplemental Process follows subsection (d) to the letter. It is undisputed that Ohio does not remove a registrant on change-of-residence grounds unless the registrant is sent and fails to mail back a return card and then fails to vote for an additional four years.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Ohio’s Supplemental Process follows subsection (d) to the letter. It is undisputed that Ohio does not remove a registrant on change-of-residence grounds unless the registrant is sent and fails to mail back a return card and then fails to vote for an additional four years.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text indicates a clear legal standard followed by Ohio in its Supplemental Process. There is no indication of bias against a party or class of persons. The passage is purely descriptive of Ohio's legal procedure. Therefore, the JSON object should be:\n\n{\"label\": \"N\", \"prob\": 0.0, \"explanation\": \"The passage is purely descriptive of Ohio's legal procedure and does not contain any indication of"}
{"instance_id": "686c080b9fe196501d6d2431:9:83", "textpassage": "\"One commissioner suggested that Phillips can believe 'what he wants to believe,' but cannot act on his religious beliefs 'if he decides to do business in the state.' Tr. 23. A few moments later, the commissioner restated the same position: '[I]f a businessman wants to do business in the state and he's got an issue with the—the law's impacting his personal belief system, he needs to look at being able to compromise.' Id., at 30.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"One commissioner suggested that Phillips can believe 'what he wants to believe,' but cannot act on his religious beliefs 'if he decides to do business in the state.' Tr. 23. A few moments later, the commissioner restated the same position: '[I]f a businessman wants to do business in the state and he's got an issue with the—the law's impacting his personal belief system, he needs to look at being able to compromise.' Id., at 30.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage discusses a legal scenario where a commissioner suggests that an individual can hold personal beliefs but must compromise on business practices if impacted by law. There is no indication of bias against a party or class of persons based on religious beliefs.\"}"}
{"instance_id": "686c080b9fe196501d6d2431:9:84", "textpassage": "\"On July 25, 2014, the Commission met again. On this occasion another commissioner made specific reference to the previous meeting's discussion but said far more to disparage Phillips' beliefs. The commissioner stated: 'I would also like to reiterate what we said in the hearing or the last meeting. Freedom of religion and religion has been used to justify all kinds of discrimination throughout history, whether it be slavery, whether it be the holocaust, whether it be—I mean, we—we can list hundreds of situations where freedom of religion has been used to justify discrimination. And to me it is one of the most despicable pieces of rhetoric that people can use to—to use their religion to hurt others.' Tr. 11–12.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"On July 25, 2014, the Commission met again. On this occasion another commissioner made specific reference to the previous meeting's discussion but said far more to disparage Phillips' beliefs. The commissioner stated: 'I would also like to reiterate what we said in the hearing or the last meeting. Freedom of religion and religion has been used to justify all kinds of discrimination throughout history, whether it be slavery, whether it be the holocaust, whether it be—I mean, we—we can list hundreds of situations where freedom of religion has been used to justify discrimination. And to me it is one of the most despicable pieces of rhetoric that people can use to—to use their religion to hurt others.' Tr. 11–12.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage describes a commissioner's criticism of Phillips' beliefs and does not indicate bias against a party or class of persons.\"}\n\nNote: The \"prob\" value represents the confidence of the annotator in their decision. It does not represent the probability of the bias being present. Cases with \"prob\" near 0.5 are the most"}
{"instance_id": "686c080b9fe196501d6d2431:9:85", "textpassage": "\"The record shows no objection to these comments from other commissioners. And the later state-court ruling reviewing the Commission's decision did not mention those comments, much less disavow them.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The record shows no objection to these comments from other commissioners. And the later state-court ruling reviewing the Commission's decision did not mention those comments, much less disavow them.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted part indicates that there was no objection from other commissioners and that a later state-court ruling did not disavow the comments. This suggests a lack of bias by judicial actors, as it implies that the comments were not contested or discredited by those in positions of authority. Therefore, the passage does not contain bias by a judicial actor against a party or class of persons.\n\n{\"label\": \"N\", \"prob"}
{"instance_id": "686c080b9fe196501d6d2451:9:86", "textpassage": "\"Several women were wearing only bras and thongs, with cash tucked into their garter belts. The women were giving lap dances while other partygoers watched.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Several women were wearing only bras and thongs, with cash tucked into their garter belts. The women were giving lap dances while other partygoers watched.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given criteria, the JSON object should be:\n\n{\"label\":\"N\", \"prob\":0.2, \"explanation\":\"The passage describes a scene without indicating any bias by a judicial actor.\"}\n\nThe passage describes a scene at a party and does not involve any judicial actor. There is no indication of bias by a judge, arbitrator, prosecutor, or juror. The focus is on the attire and actions of the women, which does not"}
{"instance_id": "686c080b9fe196501d6d2454:9:87", "textpassage": "\"Gattie’s remarkable affidavit—which he never retracted—presents a strong factual basis for the argument that Tharpe’s race affected Gattie’s vote for a death verdict.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Gattie’s remarkable affidavit—which he never retracted—presents a strong factual basis for the argument that Tharpe’s race affected Gattie’s vote for a death verdict.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text discusses Gattie's affidavit and its impact on the argument regarding Tharpe's race. This analysis focuses on whether there is bias by a judicial actor against a party or class of persons. The passage itself does not explicitly state bias but rather presents a factual argument based on the affidavit. Without explicit evidence of bias from a judicial actor, the passage does not inherently convey bias against a party or class."}
{"instance_id": "686c080b9fe196501d6d2460:9:88", "textpassage": "\"The PTO disapproved registration for the mark BONG HITS 4 JESUS because it 'suggests that people should engage in an illegal activity [in connection with] worship' and because 'Christians would be morally outraged by a statement that connects Jesus Christ with illegal drug use.' Office Action of Mar. 15, 2008, Serial No. 77305946. And the PTO refused to register trademarks associating religious references with products (AGNUS DEI for safes and MADONNA for wine) because they would be 'offensive to most individuals of the Christian faith' and 'shocking to the sense of propriety.' Ex parte Summit Brass & Bronze Works, 59 USPQ 22, 23 (Dec. Com. Pat. 1943); In re Riverbank Canning Co., 95 F.2d 327, 329 (CCPA 1938). But once again, the PTO approved marks—PRAISE THE LORD for a game and JESUS DIED FOR YOU on clothing—whose message suggested religious faith rather than blasphemy or irreverence.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The PTO disapproved registration for the mark BONG HITS 4 JESUS because it'suggests that people should engage in an illegal activity [in connection with] worship' and because 'Christians would be morally outraged by a statement that connects Jesus Christ with illegal drug use.' Office Action of Mar. 15, 2008, Serial No. 77305946. And the PTO refused to register trademarks associating religious references with products (AGNUS DEI for safes and MADONNA for wine) because they would be 'offensive to most individuals of the Christian faith' and'shocking to the sense of propriety.' Ex parte Summit Brass & Bronze Works, 59 USPQ 22, 23 (Dec. Com. Pat. 1943); In re Riverbank Canning Co., 95 F.2d 327, 329 (CCPA 1938). But once again, the PTO approved marks—PRAISE THE LORD for a game and JESUS DIED FOR YOU on clothing—whose message suggested religious faith rather than blasphemy or irreverence.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nThe highlighted passage does not contain bias by a judicial actor against a party or class of persons. It merely describes the reasoning behind the Patent Office's decisions to disapprove certain trademark registrations and approve others based on their content and potential impact on religious sensibilities. The explanation focuses on the content of the marks and their implications rather than on any bias against a specific group.\n\n{\"label\": \"N\", \"prob\": 0.0, \"explanation\": "}
{"instance_id": "686c080b9fe196501d6d2464:9:89", "textpassage": "\"The State tried to strike all 36 black prospective jurors over the course of the first four trials. And the state courts themselves concluded that the State had violated Batson on two separate occasions.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The State tried to strike all 36 black prospective jurors over the course of the first four trials. And the state courts themselves concluded that the State had violated Batson on two separate occasions.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"} Alright\n{\"label\": \"Y\", \"prob\": 0.8, \"explanation\": \"The State tried to strike all 36 black prospective jurors over the course of the first four trials, which indicates discriminatory intent against a class of persons"}
{"instance_id": "686c080b9fe196501d6d2464:9:90", "textpassage": "\"The State spent far more time questioning the black prospective jurors than the accepted white jurors—145 questions asked of 5 black prospective jurors and 12 questions asked of 11 white seated jurors.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The State spent far more time questioning the black prospective jurors than the accepted white jurors—145 questions asked of 5 black prospective jurors and 12 questions asked of 11 white seated jurors.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"Y\", \"prob\": 0.9, \"explanation\": \"The State spent far more time questioning the black prospective jurors than the accepted white jurors—145 questions asked of 5 black prospective jurors and 12 questions asked of 11 white seated jurors.\"}\n\nThe passage suggests that the State (which could refer to the prosecution or the state's legal representation) spent significantly"}
{"instance_id": "686c080b9fe196501d6d2464:9:91", "textpassage": "\"Carolyn Wright, a black prospective juror, was struck, the State says, in part because she knew several defense witnesses and had worked at Wal-Mart where Flowers’ father also worked. But three white prospective jurors also knew many individuals involved in the case, and the State asked them no individual questions about their connections to witnesses.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Carolyn Wright, a black prospective juror, was struck, the State says, in part because she knew several defense witnesses and had worked at Wal-Mart where Flowers’ father also worked. But three white prospective jurors also knew many individuals involved in the case, and the State asked them no individual questions about their connections to witnesses.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"} Alright\nExplanation: The passage states that a black prospective juror was struck in part because she knew several defense witnesses and had worked at Wal-Mart where Flowers’ father also worked. However, it also mentions that three white prospective jurors, who were also familiar with"}
{"instance_id": "686c080b9fe196501d6d2464:9:92", "textpassage": "\"The overall context here requires skepticism of the State’s strike of Carolyn Wright.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The overall context here requires skepticism of the State’s strike of Carolyn Wright.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, determine if there is bias by a judicial actor against Carolyn Wright and justify your answer with a single sentence quoting the key phrase.\n\n{\"label\": \"N\", \"prob\": 0.2, \"explanation\": \"The passage expresses skepticism towards the State's action against Carolyn Wright, but does not explicitly state that a judicial actor harbors bias against her. It merely questions the legitimacy of the State"}
{"instance_id": "686c080b9fe196501d6d2464:9:93", "textpassage": "\"In the six trials combined, the State employed its peremptory challenges to strike 41 of the 42 black prospective jurors that it could have struck—a statistic that the State acknowledged at oral argument in this Court.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"In the six trials combined, the State employed its peremptory challenges to strike 41 of the 42 black prospective jurors that it could have struck—a statistic that the State acknowledged at oral argument in this Court.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text indicates that the State used its peremptory challenges to strike 41 out of 42 black prospective jurors. This statistic was acknowledged by the State during oral argument, which suggests a potential bias against black prospective jurors. The careful use of peremptory challenges to exclude a large number of black jurors can be seen as discriminatory and indicative of bias. Therefore, the passage does contain bias.\n\n{\"label\": "}
{"instance_id": "686c080b9fe196501d6d2464:9:94", "textpassage": "\"The State then struck at least one black prospective juror, Carolyn Wright, who was similarly situated to white prospective jurors who were not struck by the State.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The State then struck at least one black prospective juror, Carolyn Wright, who was similarly situated to white prospective jurors who were not struck by the State.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text indicates that a black prospective juror, Carolyn Wright, was struck by the State despite being similarly situated to white prospective jurors who were not struck. This suggests potential bias against a person of a certain race. Therefore, the JSON object should be:\n\n{\"label\":\"Y\", \"prob\":0.7, \"explanation\":\"The State struck a black prospective juror, Carolyn Wright, who was similarly situated to"}
{"instance_id": "686c080b9fe196501d6d2464:9:95", "textpassage": "\"The trial court at Flowers’ sixth trial committed clear error in concluding that the State’s peremptory strike of black prospective juror Carolyn Wright was not motivated in substantial part by discriminatory intent.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The trial court at Flowers’ sixth trial committed clear error in concluding that the State’s peremptory strike of black prospective juror Carolyn Wright was not motivated in substantial part by discriminatory intent.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text states that the trial court made a clear error in its assessment of the State's peremptory strike. This suggests a recognition of a potential discriminatory intent, which is a corrective observation rather than an expression of bias. Therefore, the passage does not contain bias by a judicial actor against a party or class of persons.\n\n{\"label\":\"N\", \"prob\":0.0, \"explanation\":\"The passage points out a clear error"}
{"instance_id": "686c080b9fe196501d6d2464:9:96", "textpassage": "\"The State’s relentless, determined effort to rid the jury of black individuals strongly suggests that the State wanted to try Flowers before a jury with as few black jurors as possible, and ideally before an all-white jury.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The State’s relentless, determined effort to rid the jury of black individuals strongly suggests that the State wanted to try Flowers before a jury with as few black jurors as possible, and ideally before an all-white jury.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text suggests a strong intent by the State to exclude black individuals from the jury. This indicates a clear bias against black individuals by a judicial actor (the State, acting on behalf of the prosecution). The determination and relentlessness of the effort to remove black jurors strongly imply a discriminatory motive. Therefore, the label is \"Y\" (bias present), with a high probability.\n\n{\"label\": \"Y\", "}
{"instance_id": "686c080b9fe196501d6d2464:9:97", "textpassage": "\"The State’s use of peremptory strikes in Flowers’ sixth trial followed the same pattern as the first four trials.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The State’s use of peremptory strikes in Flowers’ sixth trial followed the same pattern as the first four trials.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text discusses the State's use of peremptory strikes in a specific trial context. Peremptory strikes are a tool typically used by the prosecutor to dismiss potential jurors without providing a reason. The passage states that the pattern of these strikes in the sixth trial mirrored the first four trials.\n\nAnalysis:\nThe passage does not inherently suggest bias against a party or class of persons. It merely describes a pattern of legal procedure."}
{"instance_id": "686c080b9fe196501d6d2469:9:98", "textpassage": "\"The cross is a symbol closely linked to World War I. The United States adopted it as part of its military honors, establishing the Distinguished Service Cross and the Navy Cross in 1918 and 1919, respectively.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The cross is a symbol closely linked to World War I. The United States adopted it as part of its military honors, establishing the Distinguished Service Cross and the Navy Cross in 1918 and 1919, respectively.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nThe symbol \"cross\" is not inherently biased, but its association with World War I and the specific honors established in the US could imply a historical or cultural bias in the context of military service. However, the passage itself does not express an opinion or judgment by a judicial actor. Therefore, the passage does not directly indicate bias by a judicial actor.\n\n{\"label\":\"N\", \"prob\":0.2, \"explanation\":\"The passage merely states historical facts about"}
{"instance_id": "686c080b9fe196501d6d2496:9:99", "textpassage": "\"The court of appeals again relied less upon the adaptive deficits to which the trial court had referred than upon Moore’s apparent adaptive strengths.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The court of appeals again relied less upon the adaptive deficits to which the trial court had referred than upon Moore’s apparent adaptive strengths.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the court of appeals relied less on the adaptive deficits and more on the adaptive strengths of Moore. This suggests a possible shift in focus that could be interpreted as downplaying the deficits identified by the trial court. However, without explicit evidence of bias or prejudice against a party or class of persons, it is difficult to definitively conclude that this reliance indicates bias. The mention of strengths and deficits could be part of a balanced legal analysis rather than"}
{"instance_id": "686c080b9fe196501d6d24a4:9:100", "textpassage": "\"the regulations cannot be viewed as neutral because they single out houses of worship for especially harsh treatment.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"the regulations cannot be viewed as neutral because they single out houses of worship for especially harsh treatment.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text suggests that the regulations are not neutral as they impose particularly strict measures on houses of worship. This could indicate bias against religious institutions. The label is \"Y\" (bias present), and the probability is assigned based on the clear implication of bias.\n\n{\"label\": \"Y\", \"prob\": 0.8, \"explanation\": \"the regulations cannot be viewed as neutral because they single out houses of"}
{"instance_id": "686c080b9fe196501d6d24ab:9:102", "textpassage": "\"The argument that the Departments could not consider RFRA at all is without merit.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The argument that the Departments could not consider RFRA at all is without merit.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the argument that the Departments could not consider RFRA at all is without merit. This statement suggests a viewpoint that RFRA (Religious Freedom Restoration Act) can indeed be considered by the Departments, implying a stance that counters a potential argument against RFRA's applicability. The use of \"without merit\" indicates a judicial perspective that finds the argument lacking in substance or validity, which could be interpreted"}
{"instance_id": "686c080b9fe196501d6d24b0:9:103", "textpassage": "\"The Montana Supreme Court held that the program, unmodified by Rule 1, aided religious schools in violation of the Montana Constitution’s no-aid provision. The Court further held that the violation required invalidating the entire program.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Montana Supreme Court held that the program, unmodified by Rule 1, aided religious schools in violation of the Montana Constitution’s no-aid provision. The Court further held that the violation required invalidating the entire program.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nThe Montana Supreme Court held that the program, unmodified by Rule 1, aided religious schools in violation of the Montana Constitution’s no-aid provision. The Court further held that the violation required invalidating the entire program.\n\n{\"label\": \"N\", \"prob\": 0.2, \"explanation\": \"The passage reports on a legal decision made by the Montana Supreme Court, which is a judicial actor. The Court's decision is"}
{"instance_id": "686c080b9fe196501d6d24b0:9:104", "textpassage": "\"The provision bars aid to any school 'controlled in whole or in part by any church, sect, or denomination.' Mont. Const., Art. X, §6(1). The provision’s title—'Aid prohibited to sectarian schools'—confirms that the provision singles out schools based on their religious character.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The provision bars aid to any school 'controlled in whole or in part by any church, sect, or denomination.' Mont. Const., Art. X, §6(1). The provision’s title—'Aid prohibited to sectarian schools'—confirms that the provision singles out schools based on their religious character.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage provided, the highlighted text \"Aid prohibited to sectarian schools\" clearly states the purpose of the provision without any indication of bias. It is a neutral description of the law's intent. Therefore, the answer is:\n\n{\"label\": \"N\", \"prob\": 0.0, \"explanation\": \"The passage states the provision's purpose neutrally without any indication of bias.\"}"}
{"instance_id": "686c080b9fe196501d6d24b0:9:105", "textpassage": "\"The Montana Supreme Court applied the no-aid provision to hold that religious schools could not benefit from the scholarship program. 393 Mont., at 464–468, 435 P.3d, at 612–614.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Montana Supreme Court applied the no-aid provision to hold that religious schools could not benefit from the scholarship program. 393 Mont., at 464–468, 435 P.3d, at 612–614.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text indicates that the Montana Supreme Court applied a legal provision to prevent religious schools from benefiting from a scholarship program. This action does not inherently suggest bias against a particular class of persons, as it appears to be based on the application of a legal provision rather than prejudice. Therefore, the label is \"N\".\n\n{\"label\": \"N\", \"prob\": 0.1, \"explanation\": \"The passage"}
{"instance_id": "686c080b9fe196501d6d24b0:9:106", "textpassage": "\"The Free Exercise Clause protects against even 'indirect coercion,' and a State 'punishes the free exercise of religion' by disqualifying the religious from government aid as Montana did here.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Free Exercise Clause protects against even 'indirect coercion,' and a State 'punishes the free exercise of religion' by disqualifying the religious from government aid as Montana did here.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text discusses a situation where a state disqualifies religious individuals from government aid, which is seen as punishing the free exercise of religion. This action is protected under the Free Exercise Clause, which suggests that the state's action could be viewed as discriminatory against a religious class. The passage does not explicitly state bias from a judicial actor but implies a potential issue with the state's action. Therefore, the label is \"N\" as there"}
{"instance_id": "686c080b9fe196501d6d24b0:9:107", "textpassage": "\"Montana’s no-aid provision bars religious schools from public benefits solely because of the religious character of the schools.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Montana’s no-aid provision bars religious schools from public benefits solely because of the religious character of the schools.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text explains a legal provision in Montana that prevents religious schools from being denied public benefits due to their religious nature. This is not an example of bias by a judicial actor against a party or class of persons, but rather a description of a legal provision. Therefore, the passage does not contain bias by a judicial actor.\n\n{\"label\": \"N\", \"prob\": 0.0, \"explanation\": \"The passage describes a"}
{"instance_id": "686c080b9fe196501d6d24b0:9:108", "textpassage": "\"The provision also bars parents who wish to send their children to a religious school from those same benefits, again solely because of the religious character of the school.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The provision also bars parents who wish to send their children to a religious school from those same benefits, again solely because of the religious character of the school.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text indicates a policy that discriminates against parents sending their children to religious schools by denying them benefits available to others. This is likely to be seen as biased against religious schools and their associated parents.\n\n{\"label\":\"Y\", \"prob\":0.8, \"explanation\":\"The provision bars parents from receiving benefits if they choose a religious school, which discriminates based on the religious character of the school.\"}"}
{"instance_id": "686c080b9fe196501d6d24b0:9:109", "textpassage": "\"The Montana Supreme Court’s basis for applying the no-aid provision was solely on religious status.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Montana Supreme Court’s basis for applying the no-aid provision was solely on religious status.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text suggests that the Montana Supreme Court's decision to apply the no-aid provision was based solely on the religious status of the parties involved. This could indicate bias against individuals or groups based on their religious beliefs, as the decision was not based on any other relevant factors. Therefore, the passage does contain bias by a judicial actor against a class of persons based on their religious status.\n\n{\"label\":\"Y\", \"prob\":0.8, "}
{"instance_id": "686c080b9fe196501d6d24b0:9:110", "textpassage": "\"The Montana Supreme Court applied the no-aid provision solely by reference to religious status.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Montana Supreme Court applied the no-aid provision solely by reference to religious status.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text states that the Montana Supreme Court applied the no-aid provision solely by reference to religious status. This suggests a potential bias against a religious class of persons, as the decision was based on their religious status. Therefore, the JSON object should reflect this interpretation.\n\n{\"label\":\"Y\", \"prob\":0.7, \"explanation\":\"The highlighted passage indicates that the court's application of the no-aid provision was based solely on religious"}
{"instance_id": "686c080b9fe196501d6d24b0:9:111", "textpassage": "\"The Montana Supreme Court explained that the no-aid provision forbids aid to any school that is 'sectarian,' 'religiously affiliated,' or 'controlled in whole or in part by churches.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Montana Supreme Court explained that the no-aid provision forbids aid to any school that is'sectarian,''religiously affiliated,' or 'controlled in whole or in part by churches.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage provided, the highlighted text describes a legal restriction without expressing any personal opinion or bias from the perspective of the Montana Supreme Court. The language is neutral and descriptive, outlining the criteria for what constitutes a school being ineligible for aid. Therefore, the passage does not contain bias by a judicial actor against a party or a class of persons.\n\n{\"label\":\"N\", \"prob\":0.0, \"explanation\":\"The passage is neutral and does not"}
{"instance_id": "686c080b9fe196501d6d24b0:9:112", "textpassage": "\"The Montana Supreme Court applied the no-aid provision to exclude religious schools from the scholarship program.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Montana Supreme Court applied the no-aid provision to exclude religious schools from the scholarship program.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage describes a legal action taken by the Montana Supreme Court, which is a judicial actor, but it does not indicate any bias against a party or class of persons. The no-aid provision was applied to exclude religious schools from a scholarship program, which is a matter of legal interpretation and application rather than bias.\"}"}
{"instance_id": "686c080b9fe196501d6d24b0:9:113", "textpassage": "\"The Montana Supreme Court applied the no-aid provision to hold that religious schools could not benefit from the scholarship program.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Montana Supreme Court applied the no-aid provision to hold that religious schools could not benefit from the scholarship program.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage states a legal decision made by the Montana Supreme Court, which is a judicial actor, but it does not indicate any bias against a party or class of persons.\"}\n\nNote: The probability value (prob) is a confidence score that the label is correct. It should be a float between 0.0 and 1.0. A probability of "}
{"instance_id": "686c080b9fe196501d6d24ff:9:114", "textpassage": "\"Saylor noticed that Cooley had 'watery, bloodshot eyes' and 'appeared to be non-native.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Saylor noticed that Cooley had 'watery, bloodshot eyes' and 'appeared to be non-native.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, can you identify bias by a judicial actor?\n{\"label\": \"N\", \"prob\": 0.2, \"explanation\": \"The description of Cooley's eyes and appearance does not inherently imply bias against a party or class of persons; it merely provides observational details without prejudging or discriminating.\"}"}
{"instance_id": "686c080b9fe196501d6d252a:9:115", "textpassage": "\"Maine’s decision to continue excluding religious schools from its tuition assistance program after Zelman thus promotes stricter separation of church and state than the Federal Constitution requires. But a State’s antiestablishment interest does not justify enactments that exclude some members of the community from an otherwise generally available public benefit because of their religious exercise.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Maine’s decision to continue excluding religious schools from its tuition assistance program after Zelman thus promotes stricter separation of church and state than the Federal Constitution requires. But a State’s antiestablishment interest does not justify enactments that exclude some members of the community from an otherwise generally available public benefit because of their religious exercise.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text suggests that Maine's policy is stricter than necessary and that excluding religious schools from a tuition assistance program based on religious exercise is not justified by the state's antiestablishment interest. This implies a critical stance towards Maine's decision, which could be seen as bias against religious schools or those supporting them. Therefore, the answer is:\n\n{\"label\":\"Y\", \"prob\":0.7, \""}
{"instance_id": "686c080b9fe196501d6d2541:9:116", "textpassage": "\"Boston concedes that it denied petitioners’ request out of Establishment Clause concerns, solely because the proposed flag 'promot[ed] a specific religion.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Boston concedes that it denied petitioners’ request out of Establishment Clause concerns, solely because the proposed flag 'promot[ed] a specific religion.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage provided, the highlighted text suggests that Boston denied the petitioners' request due to concerns related to the Establishment Clause, specifically because the proposed flag promoted a specific religion. This reasoning indicates a legal consideration rather than bias against a party or class of persons. Therefore, the passage does not contain bias by a judicial actor against a party or class of persons.\n\n{\"label\":\"N\", \"prob\":0.1, \"explanation\":\"The passage explains the"}
{"instance_id": "686c080b9fe196501d6d2545:9:117", "textpassage": "\"Congress has long maintained federal tax and benefits programs for residents of Puerto Rico and the other Territories that differ in some respects from the federal tax and benefits programs for residents of the 50 States.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Congress has long maintained federal tax and benefits programs for residents of Puerto Rico and the other Territories that differ in some respects from the federal tax and benefits programs for residents of the 50 States.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text explains that Congress has different federal tax and benefits programs for residents of Puerto Rico and other territories compared to the residents of the 50 states. This information is a factual statement about the structure of federal programs and does not express a bias by a judicial actor. Therefore, the answer is:\n\n{\"label\": \"N\", \"prob\": 0.0, \"explanation\": \"The passage is a factual statement about"}
{"instance_id": "686c080b9fe196501d6d2547:9:118", "textpassage": "\"The prosecution offered a very different version of events. It stressed that Ms. White was 5’2” tall, 103 pounds, and had a broken wrist, while Mr. Davenport was 6’5” tall and weighed nearly 300 pounds.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The prosecution offered a very different version of events. It stressed that Ms. White was 5’2” tall, 103 pounds, and had a broken wrist, while Mr. Davenport was 6’5” tall and weighed nearly 300 pounds.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the prosecutor is presenting a specific physical description of the two individuals involved in the case. This description could potentially influence the perception of the individuals' capabilities or roles in the events in question. The phrase \"stressed that Ms. White was 5’2” tall, 103 pounds, and had a broken wrist\" suggests a focus on her vulnerability, which might be intended to sway the jury's perception. Therefore, the passage does contain"}
{"instance_id": "686c080b9fe196501d6d254d:9:119", "textpassage": "\"The Governor’s map intentionally created seven majority-black districts—one more than the current map.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Governor’s map intentionally created seven majority-black districts—one more than the current map.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the information in the passage, the highlighted text suggests that the Governor intentionally created an additional majority-black district compared to the current map. This could be interpreted as an attempt to address or create a specific demographic representation, which might be seen as either positive or negative depending on one's perspective on affirmative action or fair representation. However, without additional context, it is difficult to determine if this action is biased against a party or class of persons. The passage itself does not"}
{"instance_id": "686c080b9fe196501d6d2572:9:120", "textpassage": "\"Black Alabamians enjoy virtually zero success in statewide elections\" and \"Alabama’s extensive history of repugnant racial and voting-related discrimination is undeniable and well documented.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Black Alabamians enjoy virtually zero success in statewide elections\" and \"Alabama’s extensive history of repugnant racial and voting-related discrimination is undeniable and well documented.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted passage \"Black Alabamians enjoy virtually zero success in statewide elections\" seems to generalize and potentially stereotype a group of people based on their race. The second passage provides context about the state's history of discrimination, which could be relevant to understanding the situation. However, the first passage alone could be interpreted as biased because it makes a sweeping statement about a group's electoral success without considering individual circumstances or recent changes. The"}
{"instance_id": "686c080b9fe196501d6d2584:9:121", "textpassage": "\"because California imports almost all the pork it consumes, most of Proposition 12’s compliance costs will be borne by out-of-state firms.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"because California imports almost all the pork it consumes, most of Proposition 12’s compliance costs will be borne by out-of-state firms.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text suggests that the compliance costs of Proposition 12 will primarily affect out-of-state firms. This information could be seen as biased because it might imply that California's domestic pork producers (if any) are not significantly impacted, potentially favoring local interests over those of out-of-state competitors. However, without explicit evidence of intentional bias from a judicial actor, it's challenging to definitively label this as such."}
{"instance_id": "686c080b9fe196501d6d25ba:9:122", "textpassage": "\"The District Court clearly erred because the Challengers did not satisfy the demanding burden of showing that the 'legislature subordinated traditional race-neutral districting principles . . . to racial considerations.' Miller, 515 U. S., at 916.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The District Court clearly erred because the Challengers did not satisfy the demanding burden of showing that the 'legislature subordinated traditional race-neutral districting principles... to racial considerations.' Miller, 515 U. S., at 916.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text discusses a legal standard that the Challengers failed to meet in a court case. The phrase \"legislature subordinated traditional race-neutral districting principles to racial considerations\" suggests a focus on the intersection of race and legislative intent in the context of a legal challenge. This does not inherently indicate bias against a party or class of persons, but rather reflects a legal analysis of the legislative process. Therefore, the passage does not contain bias by a"}
{"instance_id": "686c080b9fe196501d6d25c0:9:123", "textpassage": "\"the new Intelligence Division commander, Captain Michael Deeba, instead asked the Department to transfer Muldrow out of the unit. Deeba wanted to replace Muldrow—whom he sometimes called 'Mrs.' rather than the customary 'Sergeant'—with a male police officer.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"the new Intelligence Division commander, Captain Michael Deeba, instead asked the Department to transfer Muldrow out of the unit. Deeba wanted to replace Muldrow—whom he sometimes called 'Mrs.' rather than the customary 'Sergeant'—with a male police officer.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage does not indicate any bias by a judicial actor against a party or class of persons.\"}\n\nThe passage does not mention a judicial actor, but rather a military actor (Captain Michael Deeba). Therefore, it does not contain bias by a judicial actor. The decision is based on the absence of any reference to a judge, arbitrator, prosecutor,"}
{"instance_id": "686c080b9fe196501d6d25c7:9:124", "textpassage": "\"In support of his claim, Mr. Fikre alleges (among other things) that FBI agents interrogated him about a mosque in Portland he once attended and threatened to keep him on the No Fly List unless he agreed to serve as an informant against his co-religionists.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"In support of his claim, Mr. Fikre alleges (among other things) that FBI agents interrogated him about a mosque in Portland he once attended and threatened to keep him on the No Fly List unless he agreed to serve as an informant against his co-religionists.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, determine if there is bias against a class of persons (in this case, co-religionists) and provide a justification.\n\n{\"label\":\"Y\", \"prob\":0.8, \"explanation\":\"The passage suggests that Fikre was threatened with being placed on the No Fly List unless he agreed to inform against his co-religionists, which could indicate bias against a religious group as he was pressured to bet"}
{"instance_id": "686c080b9fe196501d6d25c7:9:125", "textpassage": "\"Mr. Fikre alleged that the government had placed him on the No Fly List for constitutionally impermissible reasons related to his race, national origin, and religious beliefs.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Mr. Fikre alleged that the government had placed him on the No Fly List for constitutionally impermissible reasons related to his race, national origin, and religious beliefs.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text suggests that Mr. Fikre believes the government's action was unconstitutional and discriminatory based on race, national origin, and religious beliefs. This indicates a potential bias by a judicial actor against Mr. Fikre, as it implies that the government's reasons for placing him on the No Fly List are unjust and possibly prejudiced. Therefore, the label should be \"Y\" (Yes), with a probability"}
{"instance_id": "686c080b9fe196501d6d25d5:9:126", "textpassage": "\"The storybooks suggest that it is hurtful, and perhaps even hateful, to hold the view that gender is inextricably bound with biological sex.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The storybooks suggest that it is hurtful, and perhaps even hateful, to hold the view that gender is inextricably bound with biological sex.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the highlighted text suggests a negative view towards holding a particular perspective on gender and biological sex. This perspective is presented as hurtful and hateful, which could indicate bias. However, without context on who holds this view or the intent behind it, it's challenging to definitively label it as bias by a judicial actor. Assuming the viewpoint is attributed to a storybook character or narrator, it might reflect a societal or educational stance rather than a judicial"}
{"instance_id": "686c080b9fe196501d6d25d5:9:127", "textpassage": "\"The Court has 'long recognized the rights of parents to direct “the religious upbringing” of their children.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Court has 'long recognized the rights of parents to direct “the religious upbringing” of their children.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the given passage, the Court has long recognized the rights of parents to direct the religious upbringing of their children. This statement reflects a judicial stance that supports parental rights in religious matters. There is no indication of bias against a party or class of persons in this passage. The language is neutral and objective, focusing on the legal recognition of parental rights. Therefore, the label is \"N\".\n\n{\"label\": \"N\", \"prob\": 0"}
{"instance_id": "686c080b9fe196501d6d25d5:9:128", "textpassage": "\"The storybooks present same-sex weddings as occasions for great celebration and suggest that the only rubric for determining whether a marriage is acceptable is whether the individuals concerned 'love each other.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The storybooks present same-sex weddings as occasions for great celebration and suggest that the only rubric for determining whether a marriage is acceptable is whether the individuals concerned 'love each other.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, determine if there is bias by a judicial actor against a party or class of persons, as indicated by the highlighted text. Consider the context and implications of presenting same-sex weddings as occasions for great celebration while suggesting that the only rubric for determining the acceptability of a marriage is 'love each other.'\n\n```json\n{\n    \"label\": \"N\",\n    \"prob\": 0.2,\n    \"explanation"}
{"instance_id": "686c080b9fe196501d6d25e4:9:129", "textpassage": "\"SB1 prohibits healthcare providers from administering puberty blockers or hormones to any minor to treat gender dysphoria, gender identity disorder, or gender incongruence, regardless of the minor’s sex; it permits providers to administer puberty blockers and hormones to minors of any sex for other purposes.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"SB1 prohibits healthcare providers from administering puberty blockers or hormones to any minor to treat gender dysphoria, gender identity disorder, or gender incongruence, regardless of the minor’s sex; it permits providers to administer puberty blockers and hormones to minors of any sex for other purposes.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.99, \"explanation\": \"The passage is a neutral description of the law and does not contain any indication of bias against a party or class of persons.\"}\n\nThe highlighted passage is a description of a law (SB1) and its provisions. It does not express any opinion or bias from a judicial actor's perspective. Instead, it objectively states what the law prohibits and permits."}
{"instance_id": "686c080b9fe196501d6d25e4:9:130", "textpassage": "\"SB1 does not classify on the basis of transgender status. The Court has explained that a State does not trigger heightened constitutional scrutiny by regulating a medical procedure that only one sex can undergo unless the regulation is a mere pretext for invidious sex discrimination.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"SB1 does not classify on the basis of transgender status. The Court has explained that a State does not trigger heightened constitutional scrutiny by regulating a medical procedure that only one sex can undergo unless the regulation is a mere pretext for invidious sex discrimination.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.99, \"explanation\": \"The passage states that SB1 does not classify on the basis of transgender status and explains that heightened scrutiny is only triggered if the regulation is a pretext for sex discrimination, which is neutral and analytical.\"}"}
{"instance_id": "686c080b9fe196501d6d25ed:9:131", "textpassage": "\"The Wisconsin Supreme Court’s interpretation of §108.02(15)(h)(2) imposes a denominational preference by differentiating between religions based on theological lines.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Wisconsin Supreme Court’s interpretation of §108.02(15)(h)(2) imposes a denominational preference by differentiating between religions based on theological lines.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the Wisconsin Supreme Court's interpretation of §108.02(15)(h)(2) is creating a denominational preference by differentiating between religions based on theological lines. This suggests a bias against a class of persons, as it implies that some religions are being treated differently based on their theological distinctions. The label is \"Y\" (bias present), and the probability is assigned based on the clear implication of"}
{"instance_id": "686c080b9fe196501d6d260c:9:132", "textpassage": "\"Among other things, the prosecution elicited testimony about Andrew’s sexual partners reaching back two decades; about the outfits she wore to dinner or during grocery runs; about the underwear she packed for vacation; and about how often she had sex in her car. At least two of the prosecution’s guilt-phase witnesses took the stand exclusively to testify about Andrew’s provocative clothing, and others were asked to comment on whether a good mother would dress or behave the way Andrew had.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Among other things, the prosecution elicited testimony about Andrew’s sexual partners reaching back two decades; about the outfits she wore to dinner or during grocery runs; about the underwear she packed for vacation; and about how often she had sex in her car. At least two of the prosecution’s guilt-phase witnesses took the stand exclusively to testify about Andrew’s provocative clothing, and others were asked to comment on whether a good mother would dress or behave the way Andrew had.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage describes the prosecution's strategy to focus on the defendant's behavior and attire, which is a common legal tactic and does not inherently indicate bias against a party or class of persons.\"}\n\n---\n\n{\"label\": \"Y\", \"prob\": 0.99, \"explanation\": \"The passage indicates that"}
{"instance_id": "686c080b9fe196501d6d260c:9:133", "textpassage": "\"In its closing statement, the prosecution again invoked these themes, including by displaying Andrew’s 'thong underwear' to the jury, by reminding the jury of Andrew’s alleged affairs during college, and by emphasizing that Andrew 'had sex on [her husband] over and over and over' while 'keeping a boyfriend on the side.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"In its closing statement, the prosecution again invoked these themes, including by displaying Andrew’s 'thong underwear' to the jury, by reminding the jury of Andrew’s alleged affairs during college, and by emphasizing that Andrew 'had sex on [her husband] over and over and over' while 'keeping a boyfriend on the side.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage describes the prosecution's strategy in a court case, which is a normal part of legal proceedings and not necessarily indicative of bias against a party or class of persons.\"}\n\n{\"label\": \"Y\", \"prob\": 0.99, \"explanation\": \"The prosecution's use of Andrew's '"}
{"instance_id": "686c080b9fe196501d6d260c:9:134", "textpassage": "\"The Oklahoma Court of Criminal Appeals (OCCA) held that admission of evidence about Andrew’s extramarital affairs had been proper because it showed that '[h]er co-defendant was just the last in a long line of men that she seduced.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Oklahoma Court of Criminal Appeals (OCCA) held that admission of evidence about Andrew’s extramarital affairs had been proper because it showed that '[h]er co-defendant was just the last in a long line of men that she seduced.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The Court's reasoning focuses on the relevance of the evidence to show a pattern of behavior rather than expressing personal bias against a class of persons.\"}\n\n---\n\n{\"label\": \"Y\", \"prob\": 0.99, \"explanation\": \"The Court's statement implies a judgment against women based on their sexual behavior, which could be"}
{"instance_id": "686c080b9fe196501d6d260c:9:135", "textpassage": "\"Judge Johnson dissented in part. In his view, the 'egregious . . . pattern of introducing evidence that ha[d] no purpose other than to hammer home that Brenda Andrew is a bad wife, a bad mother, and a bad woman . . . trivialize[d] the value of her life in the minds of the jurors.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Judge Johnson dissented in part. In his view, the 'egregious... pattern of introducing evidence that ha[d] no purpose other than to hammer home that Brenda Andrew is a bad wife, a bad mother, and a bad woman... trivialize[d] the value of her life in the minds of the jurors.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage describes a judge's dissenting opinion regarding the introduction of prejudicial evidence, which does not inherently indicate bias against a party or class of persons but rather concerns the fairness of the trial process.\"}\n\nNote: The \"prob\" key in the JSON should represent the model's confidence in its decision, with 0.0 indicating no confidence"}
{"instance_id": "686c080b9fe196501d6d260c:9:136", "textpassage": "\"In federal court, Andrew reiterated her claim that the admission of this evidence rendered the guilt and penalty phases of her trial fundamentally unfair, in violation of due process.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"In federal court, Andrew reiterated her claim that the admission of this evidence rendered the guilt and penalty phases of her trial fundamentally unfair, in violation of due process.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text discusses Andrew's claim in a federal court setting about the unfairness of her trial due process. The passage does not indicate any bias by a judicial actor but rather presents a legal argument made by Andrew. Therefore, the JSON object should reflect that there is no bias.\n\n{\"label\": \"N\", \"prob\": 0.0, \"explanation\": \"The passage discusses Andrew's legal claim, not a judicial"}
{"instance_id": "686c080b9fe196501d6d260c:9:137", "textpassage": "\"Judge Bacharach condemned the State’s focus 'from start to finish on Ms. Andrew’s sex life,' a move he argued 'portrayed Ms. Andrew as a scarlet woman, a modern Jezebel, sparking distrust based on her loose morals . . . plucking away any realistic chance that the jury would seriously consider her version of events.'\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Judge Bacharach condemned the State’s focus 'from start to finish on Ms. Andrew’s sex life,' a move he argued 'portrayed Ms. Andrew as a scarlet woman, a modern Jezebel, sparking distrust based on her loose morals... plucking away any realistic chance that the jury would seriously consider her version of events.'\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.85, \"explanation\": \"The passage describes a judge's criticism of the state's focus on Ms. Andrew's sex life, which he argues unfairly portrays her and undermines her credibility. This suggests a bias against the state's approach rather than against Ms. Andrew herself.\"}\n\nNote: The \"prob\" value is a confidence score indicating the probability that"}
{"instance_id": "686c080b9fe196501d6d260c:9:138", "textpassage": "\"The Court of Appeals must ask that question separately for the guilt and sentencing phases. As to each phase, it might consider the relevance of the disputed evidence to the charges or sentencing factors, the degree of prejudice Andrew suffered from its introduction, and whether the trial court provided any mitigating instructions.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Court of Appeals must ask that question separately for the guilt and sentencing phases. As to each phase, it might consider the relevance of the disputed evidence to the charges or sentencing factors, the degree of prejudice Andrew suffered from its introduction, and whether the trial court provided any mitigating instructions.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the Court of Appeals is instructed to consider several factors when evaluating disputed evidence. The passage does not express any personal opinion or preference regarding Andrew's guilt or innocence, nor does it suggest any bias against a party or class of persons. Instead, it outlines a procedural approach for evaluating evidence in a legal context. Therefore, the passage does not contain bias by a judicial actor.\n\n{\"label\": \"N\", \"prob\":"}
{"instance_id": "686c080b9fe196501d6d260c:9:139", "textpassage": "\"The Court today says nothing about the strength of the evidence against Andrew because the issue of prejudice in both the guilt and sentencing phases of the trial is one for the Tenth Circuit to consider on remand.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Court today says nothing about the strength of the evidence against Andrew because the issue of prejudice in both the guilt and sentencing phases of the trial is one for the Tenth Circuit to consider on remand.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the highlighted text discusses the Court's stance on the issue of prejudice in the trial phases and indicates that this is a matter for the Tenth Circuit to consider on remand. The Court does not comment on the strength of the evidence against Andrew. This passage does not express any opinion or bias by a judicial actor against a party or class of persons. It is a neutral statement of the Court's position on procedural matters. Therefore, the label"}
{"instance_id": "686c080b9fe196501d6d260c:9:140", "textpassage": "\"The dissent asserts that Andrew falsely accuses the prosecution of calling her a 'slut puppy' in closing argument.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The dissent asserts that Andrew falsely accuses the prosecution of calling her a'slut puppy' in closing argument.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the dissent claims that Andrew was falsely accused by the prosecution of being called a'slut puppy' in the closing argument. This suggests that the prosecution, as a judicial actor, is being accused of bias against Andrew. Therefore, the highlighted passage does contain bias by a judicial actor against a party.\n\n{\"label\": \"Y\", \"prob\": 0.8, \"explanation\": \"The prosecution is"}
{"instance_id": "686c080b9fe196501d6d260c:9:141", "textpassage": "\"Andrew never objected to evidence that she had a 'close personal relationship' with these men. In fact, defense counsel stipulated that she had affairs with them.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"Andrew never objected to evidence that she had a 'close personal relationship' with these men. In fact, defense counsel stipulated that she had affairs with them.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the passage, the highlighted text suggests that defense counsel acknowledged Andrew's affairs, which indicates a lack of bias by a judicial actor. The statement does not show any indication of bias against a party or class of persons. Therefore, the answer is:\n\n{\"label\": \"N\", \"prob\": 0.1, \"explanation\": \"The passage indicates that defense counsel acknowledged Andrew's affairs, which suggests a lack of bias rather than bias against"}
{"instance_id": "686c080b9fe196501d6d260c:9:142", "textpassage": "\"The dissent recites what it insists was substantial evidence of Andrew’s guilt, contending in the process that this Court 'inaccurately portrays' that evidence.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The dissent recites what it insists was substantial evidence of Andrew’s guilt, contending in the process that this Court 'inaccurately portrays' that evidence.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\nBased on the provided passage, the dissent is arguing that the majority court has misrepresented the evidence. This suggests a bias against the majority's portrayal of the evidence, which could be seen as a bias against the party or class of persons associated with the majority's view. Therefore, the JSON object would be:\n\n{\"label\":\"Y\", \"prob\":0.7, \"explanation\":\"The dissent insists on the substantial evidence of guilt and cont"}
{"instance_id": "686c080b9fe196501d6d260d:9:143", "textpassage": "\"The Act makes it unlawful for any entity to provide certain services to 'distribute, maintain, or update' a 'foreign adversary controlled application' in the United States. §2(a)(1). Entities that violate this prohibition are subject to civil enforcement actions and hefty monetary penalties.\"", "teacher_output": "\nYou are a careful legal annotator.\nPassage: \"The Act makes it unlawful for any entity to provide certain services to 'distribute, maintain, or update' a 'foreign adversary controlled application' in the United States. §2(a)(1). Entities that violate this prohibition are subject to civil enforcement actions and hefty monetary penalties.\"\n\nTask:\nDecide whether the HIGHLIGHTED PASSAGE contains bias by a judicial actor (judge, arbitrator, prosecutor, juror) against a party or a class of persons.\nReturn a JSON object EXACTLY with these keys:\n{\"label\":\"Y\" or \"N\", \"prob\":float(0.0-1.0), \"explanation\":\"one-sentence justification quoting the key phrase if present\"}\n{\"label\": \"N\", \"prob\": 0.99, \"explanation\": \"The passage is a legal text and does not contain any indication of bias from a judicial actor.\"}\n\nThe highlighted passage is a legal provision and does not contain any indication of bias from a judicial actor. It is a neutral statement of law. Therefore, the label is \"N\" (No) with a high probability (0.99) that it is"}
